<?xml version="1.0" ?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml">
<head>
<title></title>
<meta http-equiv="content-type" content="text/html; charset=utf-8" />
<link rev="made" href="mailto:root@localhost" />
<LINK REL="stylesheet" TYPE="text/css" HREF="../../jmpod.css">
</HEAD>


<BODY><A HREF="../../index.html">JM Home Page</A>
<A HREF="../../pod/zebedee/release/zebedee.pod">pod page</A>
<HR>




<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#">&#x66F8;&#x5F0F;</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a>
    <ul>
      <li><a href="#Whats-in-a-name">&#x540D;&#x524D;&#x306E;&#x7531;&#x6765;&#x306F;?(What&#39;s in a name?)</a></li>
      <li><a href="#Basic-Usage">&#x57FA;&#x672C;&#x7684;&#x306A;&#x4F7F;&#x3044;&#x65B9;(Basic Usage)</a></li>
      <li><a href="#UDP-UDP-Tunnelling">UDP&#x30C8;&#x30F3;&#x30CD;&#x30EA;&#x30F3;&#x30B0;(UDP Tunnelling)</a></li>
      <li><a href="#Some-Terminology">&#x8A00;&#x8449;&#x306E;&#x5B9A;&#x7FA9;(Some Terminology)</a></li>
      <li><a href="#Configuration-File">&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;(Configuration File)</a>
        <ul>
          <li><a href="#Client-Only-Keywords">&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x5C02;&#x7528;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Client-Only Keywords)</a></li>
          <li><a href="#Server-Only-Keywords">&#x30B5;&#x30FC;&#x30D0;&#x5C02;&#x7528;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Server-Only Keywords)</a></li>
          <li><a href="#Compression-and-Encryption-Keywords">&#x5727;&#x7E2E;&#x3068;&#x6697;&#x53F7;&#x5316;&#x95A2;&#x9023;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Compression and Encryption Keywords)</a></li>
          <li><a href="#Miscellaneous-Keywords">&#x69D8;&#x3005;&#x306A;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Miscellaneous Keywords)</a></li>
          <li><a href="#Other-Options">&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;(Other Options)</a></li>
        </ul>
      </li>
      <li><a href="#Identity-Checking">Identity Checking</a></li>
      <li><a href="#Notes-on-Other-Security-Issues">&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x95A2;&#x9023;&#x306E;&#x6CE8;&#x8A18;(Notes on Other Security Issues)</a></li>
    </ul>
  </li>
  <li><a href="#TROUBLESHOOTING">&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;(TROUBLESHOOTING)</a></li>
  <li><a href="#EXAMPLES">EXAMPLES</a>
    <ul>
      <li><a href="#Example-Server-Configuration">&#x30B5;&#x30FC;&#x30D0;&#x8A2D;&#x5B9A;&#x306E;&#x4F8B;(Example Server Configuration)</a></li>
      <li><a href="#VNC-Use-with-VNC">VNC&#x306E;&#x4F7F;&#x7528;&#x4F8B;(Use with VNC)</a></li>
      <li><a href="#X-Window-System-Use-with-the-X-Window-System">X Window System&#x306E;&#x4F7F;&#x7528;&#x4F8B;(Use with the X Window System)</a></li>
      <li><a href="#HTTP-Securing-HTTP-traffic">HTTP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;(Securing HTTP traffic)</a></li>
      <li><a href="#FTP-Securing-FTP-traffic">FTP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;(Securing FTP traffic)</a></li>
    </ul>
  </li>
  <li><a href="#CREDITS-AND-LEGALITIES">CREDITS AND LEGALITIES</a>
    <ul>
      <li><a href="#Thanks">Thanks</a></li>
    </ul>
  </li>
</ul>

<h1 id="NAME">NAME</h1>

<p>Zebedee --- &#x30B7;&#x30F3;&#x30D7;&#x30EB;&#x3067;&#x30D5;&#x30EA;&#x30FC;&#x3067;&#x30BB;&#x30AD;&#x30E5;&#x30A2;&#x306A;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;</p>
</P>

<h1 id="">&#x66F8;&#x5F0F;</h1>

<dl>

<dt id="Server">Server:</dt>
<dd>

<p><b>zebedee</b> <b>-s</b> [<b>-dDtu</b>] [<b>-f</b> <i>file</i>] [<b>-k</b> <i>keybits</i>] [<b>-n</b> <i>name</i>] [<b>-o</b> <i>logfile</i>] [<b>-r</b> <i>ports</i>] [<b>-v</b> <i>level</i>] [<b>-x</b> <i>config</i>] [<b>-z</b> <i>level</i>] [<i>targethost</i>]</p>
</P>

</dd>
<dt id="Client">Client:</dt>
<dd>

<p><b>zebedee</b> [<b>-dDmtu</b>] [<b>-e</b> <i>command</i>] [<b>-f</b> <i>file</i>] [<b>-k</b> <i>keybits</i>] [<b>-n</b> <i>name</i>] [<b>-o</b> <i>log</i>] [<b>-v</b> <i>level</i>] [<b>-x</b> <i>config</i>] [<b>-z</b> <i>level</i>] [[<i>clientports</i>:]<i>serverhost</i>[:<i>targetport</i>]]</p>
</P>

</dd>
<dt id="Key-generation">Key generation:</dt>
<dd>

<p><b>zebedee</b> <b>-p</b> [<b>-f</b> <i>file</i>]</p>
</P>

<p><b>zebedee</b> <b>-P</b> [<b>-p</b>] [<b>-f</b> <i>file</i>]</p>
</P>

</dd>
<dt id="Hash-generation">Hash generation:</dt>
<dd>

<p><b>zebedee</b> <b>-h</b> [<i>file ...</i>]</p>
</P>

<p><b>zebedee</b> <b>-H</b> <i>string</i> ...</p>
</P>

</dd>
<dt id="Windows-Service">Windows Service:</dt>
<dd>

<p><b>zebedee</b> [<b>-n</b> <i>name</i>] <b>-S</b> [install[=<i>file</i>] | remove | run]</p>
</P>

</dd>
</dl>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p><b>Zebedee</b>&#x306F;2&#x3064;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x9593;&#x3067;&#x3001; &#x6697;&#x53F7;&#x5316;&#x3055;&#x308C;&#x3001;&#x5727;&#x7E2E;&#x3055;&#x308C;&#x305F;TCP/IP&#x307E;&#x305F;&#x306F;UDP&#x306E;&quot;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&quot;&#x3092;&#x78BA;&#x7ACB;&#x3059;&#x308B;&#x5358;&#x7D14;&#x306A;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x3001;&#x4F4E;&#x5E2F;&#x57DF;&#x306E;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x4E0A;&#x3067;&#x306E;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x3092;&#x5727;&#x7E2E;&#x306B;&#x3088;&#x308A;&#x5411;&#x4E0A;&#x3059;&#x308B;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;&#x3001; <b>telnet</b>, <b>ftp</b> &#x3084; <b>X</b> &#x306A;&#x3069;&#x306E; TCP &#x30D9;&#x30FC;&#x30B9;&#x306E; &#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x3092;&#x76D7;&#x8074;&#x304B;&#x3089;&#x9632;&#x5FA1;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x306B;&#x3059;&#x308B;&#x3002; &#x307E;&#x305F;&#x3001;&#x6697;&#x53F7;&#x5316;&#x306E;&#x6709;&#x7121;&#x306B;&#x304B;&#x304B;&#x308F;&#x3089;&#x305A;&#x30C7;&#x30FC;&#x30BF;&#x5727;&#x7E2E;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x9045;&#x3044;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x3067;&#x826F;&#x597D;&#x306A;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x3092;&#x5F97;&#x308B;&#x3053;&#x3068;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p><b>Zebedee</b> &#x306E;&#x4E3B;&#x306A;&#x76EE;&#x7684;&#x306F;:</p>
</P>

<ul>

<li><p>UNIX &#x3068; Windows 95/98/NT &#x306E;&#x53CC;&#x65B9;&#x306B;&#x3066;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x3002;</p>

</li>
<li><p>&#x307B;&#x3093;&#x306E;&#x5C11;&#x3057;&#x306E;&#x8A2D;&#x5B9A;&#x304B;&#x5168;&#x304F;&#x306E;&#x8A2D;&#x5B9A;&#x7121;&#x3057;&#x3067;&#x7C21;&#x5358;&#x306B;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3001;&#x4F7F;&#x7528;&#x3001;&#x4FDD;&#x5B88;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>

</li>
<li><p>&#x5C11;&#x3057;&#x306E;&#x4ED8;&#x52A0;&#x30C7;&#x30FC;&#x30BF;&#x3068;&#x3001;&#x5C11;&#x306A;&#x3044;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306E;&#x30AA;&#x30FC;&#x30D0;&#x30D8;&#x30C3;&#x30C9;&#x306B;&#x3066;&#x3001; &#x5727;&#x7E2E;&#x306B;&#x3088;&#x308A;&#x591A;&#x5927;&#x306A;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x306E;&#x4F4E;&#x6E1B;&#x3092;&#x884C;&#x3046;&#x3002;</p>

</li>
<li><p>&#x7279;&#x8A31;&#x5316;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x304B;&#x3001;&#x307E;&#x305F;&#x306F;&#x7279;&#x8A31;&#x306E;&#x6709;&#x52B9;&#x671F;&#x9650;&#x304C;&#x5207;&#x308C;&#x3066;&#x3044;&#x308B;&#x30A2;&#x30EB;&#x30B4;&#x30EA;&#x30BA;&#x30E0;&#x306E;&#x307F;&#x3092;&#x7528;&#x3044;&#x308B;&#x3002;</p>

</li>
<li><p>GNU &#x4E00;&#x822C;&#x516C;&#x6709;&#x4F7F;&#x7528;&#x8A31;&#x8AFE;&#x66F8;(GPL)&#x306E;&#x3082;&#x3068;&#x3067;&#x5546;&#x7528;&#x3001;&#x975E;&#x5546;&#x7528;&#x3092;&#x554F;&#x308F;&#x305A; &#x5B8C;&#x5168;&#x306B;&#x30D5;&#x30EA;&#x30FC;&#x306B;&#x4F7F;&#x7528;&#x30FB;&#x914D;&#x5E03;&#x304C;&#x3067;&#x304D;&#x308B; (<a href="#CREDITS-AND-LEGALITIES">&quot;CREDITS AND LEGALITIES&quot;</a> &#x3092;&#x898B;&#x3088;)&#x3002;</p>

</li>
</ul>

<p>&#x3082;&#x3061;&#x308D;&#x3093;&#x3001;<b>Zebedee</b> &#x306F;&#x521D;&#x3081;&#x3066;&#x306E;&#x3042;&#x308B;&#x3044;&#x306F;&#x552F;&#x4E00;&#x306E;&#x5229;&#x7528;&#x53EF;&#x80FD;&#x306A; &#x30BB;&#x30AD;&#x30E5;&#x30A2;&#x306A;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3067;&#x306F;&#x306A;&#x3044;&#x3002; &#x9AD8;&#x6A5F;&#x80FD;&#x3068;&#x3044;&#x3046;&#x9762;&#x3067;&#x306F; <b>ssh</b> &#x3084; <b>SSL</b> &#x306A;&#x3069;&#x3068;&#x306F;&#x6BD4;&#x3079;&#x7269;&#x306B;&#x3082;&#x306A;&#x3089;&#x306A;&#x3044;&#x304C;&#x3001; &#x3082;&#x3057;&#x3001;&#x7D20;&#x65E9;&#x304F;&#x3001;&#x5358;&#x7D14;&#x3067;&#x3001;<b>&#x5B8C;&#x5168;&#x306B;&#x30D5;&#x30EA;&#x30FC;</b>&#x306A;&#x3082;&#x306E;&#x3092;&#x6C42;&#x3081; &#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001;&#x3053;&#x308C;&#x306F;&#x30D4;&#x30C3;&#x30BF;&#x30EA;&#x306E;&#x30C4;&#x30FC;&#x30EB;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x6587;&#x66F8;&#x306F; <b>Zebedee</b> &#x30EA;&#x30EA;&#x30FC;&#x30B9; 2.0.0 &#x306E;&#x6A5F;&#x80FD;&#x306B;&#x3064;&#x3044;&#x3066;&#x8A18;&#x3057;&#x3066;&#x3044;&#x308B;.</p>
</P>

<h2 id="Whats-in-a-name">&#x540D;&#x524D;&#x306E;&#x7531;&#x6765;&#x306F;?(What&#39;s in a name?)</h2>

<p>&#x3042;&#x306A;&#x305F;&#x304C;&#x7591;&#x554F;&#x3092;&#x6301;&#x3068;&#x3046;&#x304C;&#x6301;&#x3064;&#x307E;&#x3044;&#x304C;&#x3001;<b>Zebedee</b> &#x306F;&#x6B21;&#x306E; 3&#x3064;&#x306E;&#x4E3B;&#x8981;&#x306A;&#x30B3;&#x30F3;&#x30DD;&#x30FC; &#x30CD;&#x30F3;&#x30C8;&#x304B;&#x3089;&#x547D;&#x540D;&#x3055;&#x308C;&#x305F;&#x3002;</p>
</P>

<ul>

<li><p><b>Z</b>lib &#x306B;&#x3088;&#x308B;&#x5727;&#x7E2E;</p>

</li>
<li><p><b>B</b>lowfish &#x306B;&#x3088;&#x308B;&#x6697;&#x53F7;&#x5316;</p>

</li>
<li><p><b>D</b>iffie-Hellman &#x306B;&#x3088;&#x308B;&#x8A8D;&#x8A3C;</p>

</li>
</ul>

<p>&#x3053;&#x308C;&#x3067;&#x308F;&#x304B;&#x3063;&#x305F;&#x3088;&#x306D;?</p>
</P>

<h2 id="Basic-Usage">&#x57FA;&#x672C;&#x7684;&#x306A;&#x4F7F;&#x3044;&#x65B9;(Basic Usage)</h2>

<p>&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x3068;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x3092;&#x5B89;&#x5168;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001; &#x307E;&#x305A;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x65B9;&#x3067;&#x3001;<b>Zebedee</b> &#x3092;&#x30B5;&#x30FC;&#x30D0;&#x30FC;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; &#x4E00;&#x756A;&#x7C21;&#x5358;&#x306A;&#x65B9;&#x6CD5;&#x306F;&#x3001;<b>-s</b> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;</p>
</P>

<pre><code> zebedee -s</code></pre>

<p>&#x3046;&#x307E;&#x304F;&#x3044;&#x3051;&#x3070;(&#x3044;&#x304F;&#x306F;&#x305A;&#xFF01;)<b>Zebedee</b>&#x306F; &#x7AEF;&#x672B;(windows&#x3067;&#x306F;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;)&#x304B;&#x3089;&#x5207;&#x308A;&#x96E2;&#x3055;&#x308C;&#x3066;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C9;&#x3067;&#x8D70;&#x308B;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304B;&#x3089;&#x306E;&#x63A5;&#x7D9A;&#x3092;&#x5F85;&#x3064;&#x3002;</p>
</P>

<p>&#x6B21;&#x306B;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30DE;&#x30B7;&#x30F3;&#x3067;<b>Zebedee</b>&#x3092;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3068;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x3079;&#x304D;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x540D;&#x304B;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7; (&#x3053;&#x3053;&#x3067;&#x306F;&#x3053;&#x308C;&#x3092;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x3068;&#x547C;&#x3076;&#x3053;&#x3068;&#x306B;&#x3059;&#x308B;)&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x540D;&#x524D;&#x304C;<code>remhost</code>&#x3067; &#x5B89;&#x5168;&#x306A;<b>telnet</b>&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5F35;&#x308A;&#x305F;&#x3044;&#x3068;&#x3057;&#x305F;&#x3089;&#x3001;&#x3053;&#x3046;&#x306A;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee remhost:telnet</code></pre>

<p>&#x5B9F;&#x969B;&#x306B;&#x306F;&#x3001;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x304C;telnet&#x306A;&#x306E;&#x3067; &#x3053;&#x306E;&#x30B1;&#x30FC;&#x30B9;&#x3067;&#x306F;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x7701;&#x7565;&#x3057;&#x3066;&#x3082;&#x3088;&#x3044;&#x3002;</p>
</P>

<pre><code> zebedee remhost</code></pre>

<p>&#x3053;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3068;&#x3001; &#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306E;&#x5165;&#x53E3;&#x306B;&#x306A;&#x308B;(&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x5074;&#x306E;)&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x756A;&#x53F7;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002; <b>Zebedee</b>&#x306F;&#x7AEF;&#x672B;&#x304B;&#x3089;&#x5207;&#x308A;&#x96E2;&#x3055;&#x308C;&#x3066;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C9;&#x3067;&#x8D70;&#x308A;&#x3001; &#x3053;&#x306E;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x5074;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x308B;&#x306E;&#x3092;&#x5F85;&#x3064;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;1234&#x3068;&#x8868;&#x793A;&#x3055;&#x308C;&#x305F;&#x3089;&#x3001;</p>
</P>

<pre><code> telnet localhost 1234</code></pre>

<p>&#x3068;&#x3059;&#x308C;&#x3070;&#x3001;<code>remhost</code>&#x306B;&#x5B89;&#x5168;&#x306A;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x7D4C;&#x7531;&#x3067;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;<b>Zebedee</b>&#x306F;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3092;&#x7D42;&#x4E86;&#x3055;&#x305B;&#x308B;&#x307E;&#x3067;&#x63A5;&#x7D9A;&#x3092;&#x5F85;&#x3061;&#x7D9A;&#x3051;&#x3066;&#x3001; &#x5FC5;&#x8981;&#x304C;&#x3042;&#x308C;&#x3070;&#x540C;&#x6642;&#x767A;&#x751F;&#x3059;&#x308B;&#x8907;&#x6570;&#x306E;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x51E6;&#x7406;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x6642;&#x306B;&#x306F;&#x3001;<b>Zebedee</b>&#x3092;&#x8D77;&#x52D5;&#x3057;&#x3001; &#x305D;&#x306E;&#x5F8C;&#x3059;&#x3050;&#x306B;&#x305D;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x3044;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; &#x3053;&#x308C;&#x3092;&#x4E00;&#x767A;&#x3067;&#x3084;&#x308B;&#x306B;&#x306F;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee -e &quot;telnet localhost %d&quot; remhost</code></pre>

<p>&#x6587;&#x5B57;&#x5217;&#x4E2D;&#x306E;&quot;<code>%d</code>&quot;&#x304C;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3068;&#x7F6E;&#x304D;&#x63DB;&#x3048;&#x3089;&#x308C;&#x308B;&#x3002;&#x5F93;&#x3063;&#x3066;&#x3001; <b>Zebedee</b>&#x306F;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x8868;&#x793A;&#x3057;&#x306A;&#x3044;(&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x306A;&#x3044;)&#x3002; &#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x5834;&#x5408;&#x306B;&#x306F;&#x3001;&#x305D;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x63A5;&#x7D9A;&#x3092;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3068;&#x540C;&#x6642;&#x306B;&#x3001; &#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x5074;&#x306E;<b>Zebedee</b>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3082;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x3044;(&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;)&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; (&#x4FDD;&#x8B77;&#x3057;&#x305F;&#x3044;&#x901A;&#x4FE1;&#x3092;&#x884C;&#x306A;&#x3046;)&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x3001;&#x7279;&#x5B9A;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3057;&#x3088;&#x3046;&#x3068;&#x3059;&#x308B;&#x5834;&#x5408;&#x3060;&#x3002; &#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;<b>Zebedee</b>&#x3092;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee clientport:hostname:targetport</code></pre>

<p>&#x4F8B;&#x3048;&#x3070;&#x3001;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;:</p>
</P>

<pre><code> zebedee 8000:webhost:80</code></pre>

<p>&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;8000&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x7D4C;&#x7531;&#x3067;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x3001; <b>webhost</b>&#x3078;&#x306E;&#x5168;&#x3066;&#x306E;HTTP&#x63A5;&#x7D9A;&#x3092;&#x4FDD;&#x8B77;&#x3059;&#x308B;&#x3002; &#x8A73;&#x7D30;&#x306F;<a>EXAMPLES</a>&#x53C2;&#x7167;&#x306E;&#x3053;&#x3068;&#x3002;</p>
</P>

<p>&#x307E;&#x305F;&#x3001;<b>Zebedee</b> &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F; &#x540C;&#x4E00;&#x30DB;&#x30B9;&#x30C8;&#x5185;&#x306E;&#x8907;&#x6570;&#x306E;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3001; &#x8907;&#x6570;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;(&#x540C;&#x6642;&#x4E26;&#x884C;&#x7684;&#x306B;)&#x6271;&#x3046;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x3068;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x6307;&#x5B9A;&#x306F;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x306B;&#x306A;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;</p>
</P>

<pre><code> zebedee 9001,9002,9003:somehost:daytime,telnet,ftp</code></pre>

<p>&#x3053;&#x308C;&#x306F;&#x3001;9001&#x756A;&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x306E;&#x901A;&#x4FE1;&#x3092;&#x3001; &#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x306E;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;<b>daytime</b>&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x3068;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x3002; &#x540C;&#x69D8;&#x306B;&#x3001;9002&#x756A;&#x306F;<b>telnet</b>&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x3001;9003&#x756A;&#x306F;<b>ftp</b>&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x8A73;&#x7D30;&#x306F; <b><a href="#item_clientport">clientport</a></b>&#x3068; <b><a href="#item_targetport">targetport</a></b>&#x3092;&#x53C2;&#x7167;&#x306E;&#x3053;&#x3068;&#x3002;</p>
</P>

<h2 id="UDP-UDP-Tunnelling">UDP&#x30C8;&#x30F3;&#x30CD;&#x30EA;&#x30F3;&#x30B0;(UDP Tunnelling)</h2>

<p><b>Zebedee</b>&#x306F;&#x3082;&#x3068;&#x3082;&#x3068;&#x306F; TCP/IP &#x306E;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x3060;&#x3051;&#x3092;&#x6271;&#x3046;&#x3088;&#x3046;&#x306B;&#x8A2D;&#x8A08;&#x3055;&#x308C;&#x305F;&#x304C;&#x3001; &#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;2.0.0&#x304B;&#x3089;&#x306F;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x30EC;&#x30B9;&#x306E;UDP&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x3082;&#x6271;&#x3048;&#x308B;&#x3088;&#x3046;&#x306B;&#x306A;&#x3063;&#x305F;&#x3002; &#x3053;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x6709;&#x52B9;&#x306B;&#x3059;&#x308B;&#x306B;&#x306F;<b>Zebedee</b>&#x3092; <b>-u</b> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x4ED8;&#x304D;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B; (&#x307E;&#x305F;&#x306F;&#x3001;<b><a href="#item_udpmode">udpmode</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;)&#x3002; &#x4F8B;&#x3048;&#x3070;&#x30B5;&#x30FC;&#x30D0;&#x5074;&#x3067;</p>
</P>

<pre><code> zebedee -s -u</code></pre>

<p>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x5074;&#x3067;</p>
</P>

<pre><code> zebedee -u 10000:somehost:echo</code></pre>

<p>&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;&#x306A;&#x304A;&#x3001;&#x3072;&#x3068;&#x3064;&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3001;TCP&#x304B;UDP&#x306E;&#x3069;&#x3061;&#x3089;&#x304B;&#x3092;&#x6271;&#x3044;&#x3001; &#x4E21;&#x65B9;&#x540C;&#x6642;&#x306B;&#x6271;&#x3046;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x4E21;&#x65B9;&#x306E;&#x30BF;&#x30A4;&#x30D7;&#x3092;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001; 2&#x3064;&#x306E;&#x72EC;&#x7ACB;&#x3057;&#x305F;&#x30A4;&#x30F3;&#x30B9;&#x30BF;&#x30F3;&#x30B9;&#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3002; TCP&#x30E2;&#x30FC;&#x30C9;&#x3068;UDP&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x9055;&#x3046;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x4F7F;&#x3046;&#x306E;&#x3067;&#x3001; &#x4E21;&#x8005;&#x3092;&#x540C;&#x3058;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x5B89;&#x5168;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>UDP&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x3082;<b>Zebedee</b>&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x9593;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306F;TCP/IP&#x3067;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x7121;&#x901A;&#x4FE1;&#x304C;&#x4E00;&#x5B9A;&#x6642;&#x9593;&#x7D9A;&#x304F;&#x3068;&#x30BF;&#x30A4;&#x30E0;&#x30A2;&#x30A6;&#x30C8;&#x3059;&#x308B;&#x3002; &#x30BF;&#x30A4;&#x30E0;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3066;&#x304B;&#x3089;&#x3055;&#x3089;&#x306B;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x6765;&#x308B;&#x3068;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306E;&#x518D;&#x63A5;&#x7D9A;&#x3092;&#x884C;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001; &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x7279;&#x6027;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F; UDP&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x304C;&#x3088;&#x304F;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x308B;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3002; &#x307E;&#x305F;&#x3001;&#x6271;&#x3048;&#x308B;UDP&#x30C0;&#x30A4;&#x30A2;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x30B5;&#x30A4;&#x30BA;&#x306B;&#x3082;&#x5236;&#x9650;&#x304C;&#x3042;&#x308B;&#x3053;&#x3068;&#x306B;&#x3082;&#x6CE8;&#x610F;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;</p>
</P>

<p>&#x8A73;&#x7D30;&#x306F;&#x3001;<b><a href="#item_maxbufsize">maxbufsize</a></b>&#x3001; <b><a href="#item_udpmode">udpmode</a></b>&#x3001; <b><a href="#item_udptimeout">udptimeout</a></b> &#x3092;&#x53C2;&#x7167;&#x306E;&#x3053;&#x3068;&#x3002;</p>
</P>

<h2 id="Some-Terminology">&#x8A00;&#x8449;&#x306E;&#x5B9A;&#x7FA9;(Some Terminology)</h2>

<p>&#x901A;&#x5E38;&#x306F;&#x3001;<b>Zebedee</b>&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x5834;&#x5408;&#x3001;&#x95A2;&#x4FC2;&#x3059;&#x308B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306F;2&#x3064;&#x3067;&#x3042;&#x308B;&#x3002; &#x7247;&#x65B9;&#x3067;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3092;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x305D;&#x308C;&#x3068;&#x901A;&#x4FE1;&#x3059;&#x308B;&#x3002; &#x53CD;&#x5BFE;&#x5074;&#x3067;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x3092;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;&#x305D;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3068;&#x4F1A;&#x8A71;&#x3059;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x6700;&#x5927;4&#x3064;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;(&#x30DE;&#x30B7;&#x30F3;)&#x304C;&#x95A2;&#x4FC2;&#x3059;&#x308B;&#x30B1;&#x30FC;&#x30B9;&#x3082;&#x3042;&#x308A;&#x3048;&#x308B;&#x3002;</p>
</P>

<pre><code> [&#x30BD;&#x30FC;&#x30B9;] &lt;===&gt; [&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;] &lt;=====&gt; [&#x30B5;&#x30FC;&#x30D0;] &lt;===&gt; [&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;]
            |                     |               |
            +- &#x5B89;&#x5168;&#x3067;&#x306A;&#x3044;         |               + &#x5B89;&#x5168;&#x3067;&#x306A;&#x3044;
               &#x63A5;&#x7D9A;               |                 &#x63A5;&#x7D9A;
                                  +- &#x5B89;&#x5168;&#x306A;&#x30C8;&#x30F3;&#x30CD;&#x30EB;</code></pre>

<p><b>Zebedee</b>&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3001; &#x30B5;&#x30FC;&#x30D0;&#x306F;&#x300C;&#x30B5;&#x30FC;&#x30D0;&#x300D;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x305D;&#x308C;&#x305E;&#x308C;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002; &#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x8A2D;&#x5B9A;&#x306E;&#x5951;&#x6A5F;&#x3068;&#x306A;&#x308B;&#x6700;&#x521D;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x300C;&#x30BD;&#x30FC;&#x30B9;&#x300D;&#x30DE;&#x30B7;&#x30F3;&#x304B;&#x3089;&#x767A;&#x751F;&#x3059;&#x308B;&#x3002; &#x300C;&#x30BD;&#x30FC;&#x30B9;&#x300D;&#x3068;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x306F;&#x9055;&#x3046;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3042;&#x3063;&#x3066;&#x3082;&#x304B;&#x307E;&#x308F;&#x306A;&#x3044;&#x304C;&#x3001; &#x901A;&#x5E38;&#x306F;&#x540C;&#x4E00;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3042;&#x308B;&#x3002; &#x30B5;&#x30FC;&#x30D0;&#x306F;&#x6700;&#x5F8C;&#x306B;&#x300C;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x300D;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3068;&#x901A;&#x4FE1;&#x3059;&#x308B;&#x3002; &#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x3082;&#x666E;&#x901A;&#x306F;&#x30BD;&#x30FC;&#x30B9;&#x3068;&#x540C;&#x3058;&#x30DE;&#x30B7;&#x30F3;&#x306B;&#x306A;&#x308B;&#x304C;&#x3001;&#x9055;&#x3046;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x3042;&#x3063;&#x3066;&#x3082;&#x5168;&#x304F;&#x554F;&#x984C;&#x306F;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x5834;&#x5408;&#x3001;&#x300C;&#x30BD;&#x30FC;&#x30B9;&#x300D;&#x3068;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x3001; &#x300C;&#x30B5;&#x30FC;&#x30D0;&#x300D;&#x3068;&#x300C;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x300D;&#x306E;&#x9055;&#x3044;&#x3092;&#x6C17;&#x306B;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x306A;&#x3044;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x3053;&#x306E;&#x7528;&#x8A9E;&#x306E;&#x533A;&#x5225;&#x304C;&#x4EE5;&#x4E0B;&#x306B;&#x8FF0;&#x3079;&#x308B;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x591A;&#x304F;&#x53CD;&#x6620;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002; &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x8AAC;&#x660E;&#x3092;&#x8AAD;&#x3080;&#x6642;&#x306B;&#x306F;&#x3001;&#x3053;&#x306E;&#x3053;&#x3068;&#x3092;&#x982D;&#x306B;&#x5165;&#x308C;&#x3066;&#x304A;&#x3044;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

<p><b>Zebedee</b>&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306B;&#x95A2;&#x4FC2;&#x3059;&#x308B;&#x3053;&#x306E;4&#x3064;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x554F;&#x984C;&#x3068;&#x5225;&#x306B;&#x3001; &#x5B89;&#x5168;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x5168;&#x304F;&#x9055;&#x3046;&#x30BF;&#x30A4;&#x30D7;&#x306E;&#x300C;&#x30AD;&#x30FC;(key)&#x300D;&#x304C;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x3002; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x306F;<b>private key</b>(&#x79D8;&#x5BC6;&#x9375;)&#x3068;&#x3044;&#x3046;&#x5024;&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3059;&#x308B; (&#x81EA;&#x5206;&#x3067;&#x751F;&#x6210;&#x3059;&#x308B;&#x5834;&#x5408;&#x3082;&#x3042;&#x308B;)&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x304B;&#x3089;&#x306F;&#x3001;public values &#x304C;&#x8A08;&#x7B97;&#x3055;&#x308C;&#x4EA4;&#x63DB;&#x3055;&#x308C;&#x3001; &#x305D;&#x308C;&#x306B;&#x3088;&#x308A;<b>shared secret key</b> &#x304C;&#x5C0E;&#x304D;&#x51FA;&#x3055;&#x308C;&#x308B; (&#x3053;&#x306E;&#x6642;&#x306B;Diffie-Hellman key agreement mechanism &#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;)&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x304B;&#x3089;&#x306F;&#x3001;&#x63A5;&#x7D9A;&#x306E;&#x305F;&#x3073;&#x306B;&#x30E6;&#x30CB;&#x30FC;&#x30AF;&#x306A;<b>session key</b>&#x304C;&#x5C0E;&#x304D;&#x51FA;&#x3055;&#x308C;&#x3001; &#x6700;&#x7D42;&#x7684;&#x306B;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x3067;&#x6697;&#x53F7;&#x5316;&#x304C;&#x884C;&#x306A;&#x308F;&#x308C;&#x308B;&#x3002;</p>
</P>

<h2 id="Configuration-File">&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;(Configuration File)</h2>

<p><b>Zebedee</b> &#x306E;&#x52D5;&#x4F5C;&#x3092;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001; &#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4F7F;&#x3046;&#x306E;&#x304C;&#x304A;&#x305D;&#x3089;&#x304F;&#x4E00;&#x756A;&#x3088;&#x3044;&#x3002;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x306B;&#x306F; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067; <b>-f</b>&#x3092;&#x4F7F;&#x3046;&#x3002;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;(<b>-f</b>)&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4F4D; &#x7F6E;&#x3067;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x3002;&#x5F93;&#x3063;&#x3066;&#x3001;&#x305D;&#x308C;&#x4EE5;&#x964D;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x5185; &#x5BB9;&#x3092;&#x4E0A;&#x66F8;&#x304D;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<p>&#x884C;&#x306E;&#x5F62;&#x5F0F;&#x306F;&#x4EE5;&#x4E0B;&#x306E;&#x3068;&#x304A;&#x308A;&#x3002;</p>
</P>

<pre><code> key value # optional comment</code></pre>

<p><i>key</i>&#x306F;&#x3072;&#x3068;&#x3064;&#x306E;&#x5358;&#x8A9E;&#x3067;&#x3042;&#x308A;&#x5927;&#x6587;&#x5B57;&#x5C0F;&#x6587;&#x5B57;&#x306F;&#x7121;&#x8996;&#x3055;&#x308C;&#x308B;&#x3002;<i>value</i>&#x306F;&#x5358;&#x8A9E;&#x304B;&#x6587;&#x5B57; &#x5217;&#x304B;&#x3069;&#x3061;&#x3089;&#x304B;&#x3067;&#x3042;&#x308B;&#x3002; &#x6587;&#x5B57;&#x5217;&#x306F;&#x30C0;&#x30D6;&#x30EB;&#x30AF;&#x30A9;&#x30FC;&#x30C8;(<code>&quot;&#x3053;&#x3093;&#x306A;&#x98A8;&#x306B;&quot;</code>)&#x304B;&#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30AF;&#x30A9;&#x30FC;&#x30C8; (<code>&#39;&#x3053;&#x3093;&#x306A;&#x98A8;&#x306B;&#39;</code>)&#x3067;&#x304F;&#x304F;&#x3089;&#x308C;&#x308B;&#x3002;&#x30C0;&#x30D6;&#x30EB;&#x30AF;&#x30A9;&#x30FC;&#x30C8; &quot; &#x306E;&#x4E2D;&#x306B; &#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30AF;&#x30A9;&#x30FC;&#x30C8; &#39; &#x304C;&#x3042;&#x3063;&#x3066;&#x3082;&#x3088;&#x3044;&#x3057;(<code>&quot;here&#39;s an example&quot;</code>)&#x3001;&#x305D;&#x306E;&#x9006;&#x3082;&#x8A00;&#x3048;&#x308B;&#x3002; value &#x3067;&#x306F;&#x5927;&#x6587;&#x5B57;&#x5C0F;&#x6587;&#x5B57;&#x306E;&#x9055;&#x3044;&#x306F;&#x533A;&#x5225;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x7A7A;&#x767D;&#x884C;&#x3068;&quot;<code>#</code>&quot;&#x3067;&#x306F;&#x3058;&#x307E;&#x308B;&#x884C;(&#x305D;&#x306E;&#x524D;&#x306B;&#x7A7A;&#x767D;&#x304C;&#x3042;&#x3063;&#x3066;&#x3082;&#x540C;&#x3058;)&#x306F;&#x7121;&#x8996;&#x3055;&#x308C;&#x308B;&#x3002; &#x9577;&#x3044;&#x6587;&#x5B57;&#x5217;&#x306F; &quot;<code>\</code>&quot;&#x3067;&#x6B21;&#x306E;&#x884C;&#x306B;&#x7D99;&#x7D9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x3053;&#x306E;&#x6587;&#x5B57;&#x306F;&#x9664;&#x53BB;&#x3055;&#x308C;&#x3001;&#x6B21;&#x306E;&#x884C;&#x304C;&#x3053;&#x306E;&#x884C;&#x306B;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x308B;&#x3002; 1&#x884C;&#x306E;&#x9577;&#x3055;&#x306F;&#x7D99;&#x7D9A;&#x884C;&#x3082;&#x542B;&#x3081; 1024 &#x6587;&#x5B57;&#x306B;&#x5236;&#x9650;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3053;&#x3068;&#x306B;&#x6CE8;&#x610F;&#x3002; &#x884C;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306E;&#x8A8D;&#x8B58;&#x3092;&#x542B;&#x3081;&#x3059;&#x3079;&#x3066;&#x306E;&#x51E6;&#x7406;&#x306B;&#x5148;&#x3060;&#x3063;&#x3066;&#x884C;&#x308F;&#x308C;&#x308B;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x4EE5;&#x4E0B;&#x306E;&#x4F8B;</p>
</P>

<pre><code> server false
 # This comment continues on the next line \
 server true</code></pre>

<p>&#x3067;&#x306F;&#x3001;<b>server</b>&#x306E;&#x5024;&#x306F; <b>false</b>&#x306B;&#x306A;&#x308B;&#x3002;</p>
</P>

<p>&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3068;&#x305D;&#x306E;&#x610F;&#x5473;&#x306F;&#x4EE5;&#x4E0B;&#x306B;&#x8FF0;&#x3079;&#x308B;&#x3002; &#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3042;&#x308B;&#x304C;&#x3001; &#x306A;&#x304B;&#x306B;&#x306F;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x306A;&#x3044;&#x3082;&#x306E;&#x3082;&#x3042;&#x308B;&#x3002; &#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3042;&#x308B;&#x3082;&#x306E;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x305D;&#x308C;&#x3082;&#x4F75;&#x8A18;&#x3057;&#x3066;&#x3042;&#x308B;&#x3002; &#x9006;&#x306B;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4E2D;&#x306B;&#x306F; &#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x5185;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x3082;&#x306E;&#x304C;&#x306A;&#x3044;&#x3082;&#x306E;&#x3082;&#x3042;&#x308B;&#x3002; &#x305D;&#x308C;&#x3089;&#x306F;&#x3053;&#x306E;&#x30BB;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x8FF0;&#x3079;&#x308B;&#x3002;</p>
</P>

<p>&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x771F;&#x507D;&#x5024;(boolean)&#x3068;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x305F;&#x3089;&#x3001; &#x305D;&#x306E;&#x5024;&#x306F;&quot;<b>true</b>&quot; &#x307E;&#x305F;&#x306F; &quot;<b>false</b>&quot;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x4E2D;&#x306B;&#x306F;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3082;&#x306E;&#x304C;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;&#x30DD;&#x30FC;&#x30C8;&#x540D;(&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x540D;)&#x3001;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3001;&#x756A;&#x53F7;&#x306E;&#x7BC4;&#x56F2;&#x3092; &#x30B3;&#x30F3;&#x30DE;&#x304B;&#x7A7A;&#x767D;&#x3067;&#x533A;&#x5207;&#x3063;&#x305F;&#x3082;&#x306E;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;&quot;<code>telnet, ftp 5900-5903</code>&quot;&#x306F; &quot;<code>23,21,5900,5901,5902,5903</code>&quot;&#x3068;&#x7B49;&#x3057;&#x3044;&#x3002;</p>
</P>

<p>&#x307E;&#x305F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3060;&#x3051;&#x306B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3082;&#x3042;&#x308B;&#x3057;&#x3001; &#x30B5;&#x30FC;&#x30D0;&#x3060;&#x3051;&#x306B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3082;&#x3042;&#x308B;&#x3002; &#x3072;&#x3068;&#x3064;&#x306E; <b>Zebedee</b> &#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x304B;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304B;&#x3069;&#x3061;&#x3089;&#x304B;&#x3072;&#x3068;&#x3064;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x5B9F;&#x884C;&#x3057;&#x3001; &#x305D;&#x306E;&#x6642;&#x306E;&#x7528;&#x9014;&#x3068;&#x9055;&#x3046;&#x7528;&#x9014;&#x5411;&#x3051;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x7121;&#x8996;&#x3059;&#x308B;&#x3002; &#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3082;&#x8868;&#x793A;&#x3057;&#x306A;&#x3044;&#x3002; &#x30B5;&#x30FC;&#x30D0;&#x306B;&#x306A;&#x308B;&#x304B;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306B;&#x306A;&#x308B;&#x304B;&#x306F;&#x3001; <b><a href="#item_server">server</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x6C7A;&#x307E;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="server--s"><b>server</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-s</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306B;&#x306A;&#x308B;&#x304B;&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x306A;&#x308B;&#x304B;&#x3092;&#x6C7A;&#x3081;&#x308B;&#x771F;&#x507D;&#x5024;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x304B;&#x3063;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x3002; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E; <b>-s</b> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x3053;&#x306E;&#x5024;&#x3092;<b>true</b>&#x306B;&#x3059;&#x308B;&#x306E;&#x3068;&#x7B49;&#x3057;&#x3044;&#x3002;</p>
</P>

</dd>
</dl>

<h3 id="Client-Only-Keywords">&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x5C02;&#x7528;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Client-Only Keywords)</h3>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3060;&#x3051;&#x306B;&#x9069;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="command--e"><b>command</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-e</b>)</dt>
<dd>

<p>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x3057;&#x3066;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x6642;&#x306B;&#x610F;&#x5473;&#x3092;&#x6301;&#x3064;&#x3002; &#x3053;&#x308C;&#x306F;&#x3001;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3078;&#x63A5;&#x7D9A;&#x3057;&#x305F;&#x5F8C;&#x306B;&#x8D77;&#x52D5;&#x3055;&#x308C;&#x308B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x793A;&#x3059;&#x3002; &#x3053;&#x306E;&#x5024;&#x304C; &quot;<code>%d</code>&quot; &#x3068;&#x3044;&#x3046;&#x6587;&#x5B57;&#x5217;&#x3092;&#x542B;&#x3093;&#x3067;&#x3044;&#x305F;&#x3089;&#x3001;&#x5B9F;&#x884C;&#x6642;&#x306B;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3068;&#x7F6E;&#x304D;&#x5909;&#x3048;&#x3089;&#x308C;&#x308B; (<b><a href="#item_clientport">clientport</a></b> &#x53C2;&#x7167;)&#x3002; &#x3053;&#x306E;&#x51E6;&#x7406;&#x306F;<b>sprintf</b>&#x95A2;&#x6570;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x884C;&#x306A;&#x3046;&#x306E;&#x3067;&#x3001; &quot;<code>%</code>&quot;&#x306B;&#x3088;&#x308B;&#x30A8;&#x30B9;&#x30B1;&#x30FC;&#x30D7;&#x51E6;&#x7406;&#x304C;&#x9069;&#x7528;&#x3055;&#x308C;&#x308B; (&#x3059;&#x306A;&#x308F;&#x3061;&#x3001;&quot;<code>%</code>&quot; &#x3092; 1 &#x6587;&#x5B57;&#x751F;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F; &quot;<code>%%</code>&quot; &#x3092;&#x4F7F;&#x3046;)&#x3002; &#x3055;&#x3089;&#x306B;&#x3001;&quot;<code>%d</code>&quot; &#x3092;&#x4E8C;&#x3064;&#x4EE5;&#x4E0A;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x308A; &quot;<code>%d</code>&quot; &#x4EE5;&#x5916;&#x306E;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30C3;&#x30C8;&#x6307;&#x5B9A;&#x5B50; &#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;&#x304A;&#x305D;&#x3089;&#x304F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x30AF;&#x30E9;&#x30C3;&#x30B7;&#x30E5;&#x3059;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

<p>&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x63A5;&#x7D9A;&#x3092;&#x9589;&#x3058;&#x305F;&#x3089;&#x3001;<b>Zebedee</b>&#x3082;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304A;&#x3088;&#x3073;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x3001;&#x6697;&#x9ED9;&#x306E;&#x3046;&#x3061;&#x306B;&#x30DE;&#x30EB;&#x30C1;&#x30E6;&#x30FC;&#x30B9;&#x30E2;&#x30FC;&#x30C9;&#x304C;OFF&#x306B;&#x306A;&#x308B; (<b><a href="#item_multiuse">multiuse</a></b>&#x53C2;&#x7167;)&#x3002; <b>Zebedee</b> &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x8907;&#x6570;&#x306E;&#x63A5;&#x7D9A;&#x3092;&#x6271;&#x3046;&#x5834;&#x5408; (<b><a href="#item_multiuse">multiuse</a></b>)&#x3084;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x304C; <b><a href="#item_clientport">clientport</a></b>&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306E;&#x81EA;&#x52D5;&#x8D77;&#x52D5;&#x306F; &#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="clientport"><b>clientport</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;<b>Zebedee</b> &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x63A5;&#x7D9A;&#x306E;&#x305F;&#x3081;&#x306B;listen&#x3059;&#x3079;&#x304D;&#x3001; &#x3072;&#x3068;&#x3064;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x304B;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x3082;&#x3057;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x306E;&#x304C;&#x5358;&#x72EC;&#x306E;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x306A;&#x3089;&#x3070;&#x3001; &#x3053;&#x308C;&#x306F;&#x7701;&#x7565;&#x3067;&#x304D;&#x308B;&#x3002; &#x305D;&#x306E;&#x5834;&#x5408;&#x306F;&#x30DD;&#x30FC;&#x30C8;&#x306F;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x5272;&#x308A;&#x5F53;&#x3066;&#x3089;&#x308C;&#x3066;&#x3001; &#x7AEF;&#x672B;&#x306B;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x793A;&#x3059;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x6642;&#x306F;&#x3001;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x304C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x306E;&#x3067;&#x3042;&#x308C;&#x3001; <b><a href="#item_targetport">targetport</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x306E;&#x3067;&#x3042;&#x308C;&#x3001; &#x30DD;&#x30FC;&#x30C8;&#x306E;&#x6570;&#x306F;&#x6B63;&#x78BA;&#x306B;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x6570;&#x3068;&#x4E00;&#x81F4;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>2.0.0&#x3088;&#x308A;&#x524D;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x540C;&#x3058;&#x610F;&#x5473;&#x3067;<b>localport</b>&#x3068;&#x3044;&#x3046;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x3002; &#x5F8C;&#x65B9;&#x4E92;&#x63DB;&#x6027;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x73FE;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x3082;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="localsource"><b>localsource</b></dt>
<dd>

<p>&#x3053;&#x306E;&#x5024;&#x304C;<b>true</b>&#x3060;&#x3068;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x767A;&#x751F;&#x3057;&#x305F;&#x63A5;&#x7D9A;&#x3060;&#x3051;&#x3092;&#x53D7;&#x3051;&#x3064;&#x3051;&#x308B;&#x3002; &#x5225;&#x306E;&#x8A00;&#x8449;&#x3067;&#x8A00;&#x3046;&#x3068;&#x3001;&#x300C;&#x30BD;&#x30FC;&#x30B9;&#x300D;&#x3068;&#x300C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x300D;&#x304C;&#x540C;&#x4E00;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3042;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x5024;&#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;<b>false</b>&#x3067;&#x3042;&#x308A;&#x3001;&#x3069;&#x306E;&#x30DE;&#x30B7;&#x30F3;&#x304C;&#x30BD;&#x30FC;&#x30B9;&#x3068;&#x306A;&#x3063;&#x3066;&#x3082;&#x63A5;&#x7D9A;&#x3092;&#x53D7;&#x3051;&#x3064;&#x3051;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="multiuse--m"><b>multiuse</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-m</b>)</dt>
<dd>

<p>&#x3053;&#x306E;&#x5024;&#x304C;<b>true</b>&#x3060;&#x3068;(&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x305D;&#x3046;&#x306A;&#x3063;&#x3066;&#x3044;&#x308B;&#x304C;)&#x3001; <b>Zebedee</b>&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x8907;&#x6570;&#x306E;&#x63A5;&#x7D9A;&#x8981;&#x6C42;(&#x540C;&#x6642;&#x4E26;&#x884C;&#x7684;&#x306B;&#x767A;&#x751F;&#x3057;&#x3066;&#x3082;&#x3088;&#x3044;)&#x3092;&#x6271;&#x3044;&#x3001; &#x8981;&#x6C42;&#x3072;&#x3068;&#x3064;&#x3072;&#x3068;&#x3064;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x3001;&#x65B0;&#x3057;&#x3044;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;&#x8A2D;&#x7F6E;&#x3059;&#x308B;&#x3002; &#x5024;&#x304C;<b>false</b>&#x3060;&#x3068;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x30B7;&#x30F3;&#x30B0;&#x30EB;&#x30E6;&#x30FC;&#x30B9;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3001; &#x6700;&#x521D;&#x306E;&#x63A5;&#x7D9A;&#x304C;&#x9589;&#x3058;&#x3089;&#x308C;&#x305F;&#x76F4;&#x5F8C;&#x306B;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;<b>-m</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x3053;&#x308C;&#x3092;<b>true</b>&#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x306E;&#x3068;&#x7B49;&#x3057;&#x3044;&#x3002; &#x73FE;&#x5728;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x306E;<b>Zebedee</b>&#x306F;&#x3053;&#x308C;&#x304C;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3060;&#x304C; (&#x3060;&#x304B;&#x3089;&#x3001;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x306A;&#x3044;&#x304C;)&#x3001; &#x5F8C;&#x65B9;&#x4E92;&#x63DB;&#x6027;&#x306E;&#x305F;&#x3081;&#x306B;&#x6B8B;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002;</p>
</P>

<p>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x8907;&#x6570;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x5F85;&#x3061;&#x53D7;&#x3051;&#x308B;&#x5834;&#x5408;&#x306F;&#x3001; &#x305F;&#x3068;&#x3048;&#x3053;&#x308C;&#x304C;<b>false</b>&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x3066;&#x3082;&#x3001; &#x81EA;&#x52D5;&#x7684;&#x306B; &#x30DE;&#x30EB;&#x30C1;&#x30E6;&#x30FC;&#x30B9;&#x30E2;&#x30FC;&#x30C9;&#x306B;&#x306A;&#x308B;&#x3002; (<b><a href="#item_clientport">clientport</a></b> &#x53C2;&#x7167;)</p>
</P>

</dd>
<dt id="serverhost"><b>serverhost</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;&#x63A5;&#x7D9A;&#x3059;&#x3079;&#x304D;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x540D;&#x524D;&#x3067;&#x3042;&#x308B;&#x3002; &#x30DB;&#x30B9;&#x30C8;&#x306E;&#x540D;&#x79F0;&#x306B;&#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;&#x306A;&#x3044;&#x306E;&#x3067;&#x3001; &#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304B;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x3069;&#x3061;&#x3089;&#x304B;&#x3067;&#x3001; &#x5FC5;&#x305A;&#x3053;&#x308C;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>2.0.0&#x3088;&#x308A;&#x524D;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x540C;&#x3058;&#x610F;&#x5473;&#x3067;<b>remotehost</b>&#x3068;&#x3044;&#x3046;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x3002; &#x5F8C;&#x65B9;&#x4E92;&#x63DB;&#x6027;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x73FE;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x3082;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="targetport"><b>targetport</b></dt>
<dd>

<p>&#x3053;&#x3053;&#x306B;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;(&#x30EA;&#x30B9;&#x30C8;&#x3082;&#x53EF;)&#x3067;&#x30BF;&#x30FC;&#x30B2;&#x30C3;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x3001; <b>Zebedee</b>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;<b>Zebedee</b>&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x8981;&#x6C42;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x3044;&#x6642;&#x306E;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;&quot;<b>telnet</b>&quot; (&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7; 23)&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x6642;&#x306F;&#x3001; &#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x304C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x306E;&#x3067;&#x3042;&#x308C;&#x3001; <b><a href="#item_clientport">clientport</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x306E;&#x3067;&#x3042;&#x308C;&#x3001; &#x30DD;&#x30FC;&#x30C8;&#x306E;&#x6570;&#x306F;&#x6B63;&#x78BA;&#x306B;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x6570;&#x3068;&#x4E00;&#x81F4;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>2.0.0&#x3088;&#x308A;&#x524D;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x540C;&#x3058;&#x610F;&#x5473;&#x3067;<b>remoteport</b>&#x3068;&#x3044;&#x3046;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x3002; &#x5F8C;&#x65B9;&#x4E92;&#x63DB;&#x6027;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x73FE;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x3082;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
</dl>

<h3 id="Server-Only-Keywords">&#x30B5;&#x30FC;&#x30D0;&#x5C02;&#x7528;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Server-Only Keywords)</h3>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x3068;&#x3057;&#x3066;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x6642;&#x306B;&#x9069;&#x7528;&#x3059;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="redirect--r"><b>redirect</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-r</b>)</dt>
<dd>

<p>&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3059;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3067;&#x3042;&#x308B;&#x3002; (&#x4F8B; &quot;<code>telnet,ftp, 5900-5910</code>&quot;) &#x3082;&#x3057; <b>redirect</b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x306A;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001; &#x3069;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x3078;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x63A5;&#x7D9A;&#x8981;&#x6C42;&#x3082;&#x53D7;&#x3051;&#x4ED8;&#x3051;&#x3089;&#x308C;&#x308B;&#x3002; &#x3053;&#x306E;&#x65B9;&#x6CD5;(<b>redirect</b>&#x3092;&#x6307;&#x5B9A;&#x3057;&#x306A;&#x3044;&#x3053;&#x3068;)&#x306F;&#x30C6;&#x30B9;&#x30C8;&#x4E2D;&#x306B;&#x306F;&#x4FBF;&#x5229;&#x3060;&#x304C;&#x3001; &#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x30FC;&#x9762;&#x3067;&#x306E;&#x30EA;&#x30B9;&#x30AF;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001; &#x3082;&#x3057;&#x53EF;&#x80FD;&#x306A;&#x3089;&#x3070;(&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;)&#x660E;&#x793A;&#x7684;&#x306B;&#x8A31;&#x53EF;&#x3059;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x3079;&#x304D;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(&#x307E;&#x305F;&#x306F;<b>-r</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;)&#x306F;&#x8907;&#x6570;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3082;&#x3088;&#x3044;&#x3002;&#x3053;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001; &#x305D;&#x306E;&#x3046;&#x3061;&#x3069;&#x308C;&#x304B;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308C;&#x3070;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x304C;&#x8A31;&#x53EF;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="targethost"><b>targethost</b></dt>
<dd>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;<b>Zebedee</b> &#x30B5;&#x30FC;&#x30D0;&#x306F; &#x5168;&#x3066;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3059;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001; &#x5168;&#x3066;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x305D;&#x306E;&#x540D;&#x79F0;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x3078;&#x3068;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3055;&#x308C;&#x308B;&#x3002; &#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;&#x5B89;&#x5168;&#x306A;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x306E;&#x4E2D;&#x306B;&#x307E;&#x3067;&#x5EF6;&#x9577;&#x3059;&#x308B;&#x306E;&#x306F;&#x7121;&#x99C4;&#x3067;&#x3042;&#x308B;&#x304C;&#x3001; &#x3053;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x3001;&#x305D;&#x306E;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x3092;&#x7701;&#x304F;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x3066;&#x4FBF;&#x5229;&#x3067;&#x3042;&#x308B;&#x3002; &#x307E;&#x305F; <b>ftp</b> &#x306E;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x3092;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x6642;&#x306B;&#x3082;&#x4F7F;&#x3048;&#x308B;&#x3002; (&#x8A73;&#x7D30;&#x306F;<a>EXAMPLES</a>&#x53C2;&#x7167;)</p>
</P>

<p><b>Zebedee</b>&#x304C;&#x30B5;&#x30FC;&#x30D0;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x6642;&#x306F;&#x3001; &#x901A;&#x4FE1;&#x3092;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3059;&#x3079;&#x304D;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x540D;&#x79F0;&#x306F;&#x3001; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x306E;&#x6700;&#x5F8C;&#x306E;&#x4ED8;&#x52A0;&#x7684;&#x306A;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3068;&#x3057;&#x3066;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<p>2.0.0&#x3088;&#x308A;&#x524D;&#x306E;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x306F;&#x3001;&#x540C;&#x3058;&#x610F;&#x5473;&#x3067;<b>redirecthost</b>&#x3068;&#x3044;&#x3046;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x3066;&#x3044;&#x305F;&#x3002; &#x5F8C;&#x65B9;&#x4E92;&#x63DB;&#x6027;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x73FE;&#x30D0;&#x30FC;&#x30B8;&#x30E7;&#x30F3;&#x3067;&#x3082;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
</dl>

<h3 id="Compression-and-Encryption-Keywords">&#x5727;&#x7E2E;&#x3068;&#x6697;&#x53F7;&#x5316;&#x95A2;&#x9023;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Compression and Encryption Keywords)</h3>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x3001;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x5185;&#x3092;&#x6D41;&#x308C;&#x308B;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x5727;&#x7E2E;&#x3068;&#x6697;&#x53F7;&#x5316;&#x3092;&#x5236;&#x5FA1;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x3089;&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x3069;&#x3061;&#x3089;&#x3067;&#x3082;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="compression--z"><b>compression</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-z</b>)</dt>
<dd>

<p><b>Zebedee</b> &#x306F;&#x5727;&#x7E2E;&#x65B9;&#x5F0F;&#x3068;&#x3057;&#x3066; <b>zlib</b> &#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;&#x3082;&#x3057;&#x30B3;&#x30F3;&#x30D1;&#x30A4;&#x30EB;&#x6642;&#x306B;&#x6709;&#x52B9;&#x306B;&#x306A;&#x3063;&#x3066;&#x3044;&#x308C;&#x3070;<b>bzip2</b>&#x3082;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x5727;&#x7E2E;&#x306E;&#x65B9;&#x5F0F;&#x3068;&#x5727;&#x7E2E;&#x30EC;&#x30D9;&#x30EB;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x5024;&#x306E;&#x5F62;&#x5F0F;&#x306F; <i>type:level</i> &#x3067;&#x3042;&#x308B;&#x3002;<i>type</i> &#x306F; &quot;<code>zlib</code>&quot; &#x3068; &quot;<code>bzip2</code>&quot;&#x306E;&#x3069;&#x3061;&#x3089;&#x304B;&#x3001;<i>level</i> &#x306F;0&#x304B;&#x3089;9&#x306E;&#x6574;&#x6570;&#x3067;&#x3042;&#x308B;&#x3002; &#x30D7;&#x30EC;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x30B9;&#x306A;&#x3057;&#x3067;&#x6574;&#x6570;&#x3060;&#x3051;&#x306E;&#x5834;&#x5408;&#x306F;&#x3001;<b>zlib</b>&#x304C;&#x9078;&#x629E;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p><i>level</i> &#x306F;&#x4F7F;&#x7528;&#x53EF;&#x80FD;&#x306A;&#x6700;&#x5927;&#x306E;&#x5727;&#x7E2E;&#x30EC;&#x30D9;&#x30EB;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B; (9&#x304C;&#x6700;&#x5927;&#x3067;0&#x304C;&#x5727;&#x7E2E;&#x306A;&#x3057;)&#x3002; &#x5B9F;&#x969B;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x5727;&#x7E2E;&#x30EC;&#x30D9;&#x30EB;&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x5024;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x5024;&#x306E;&#x6700;&#x5C0F;&#x5024;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x76EE;&#x7684;&#x3067;&#x306F;&#x3001;(0&#x4EE5;&#x5916;&#x306E;)<b>bzip2</b>&#x30EC;&#x30D9;&#x30EB;&#x306F;&#x3044;&#x304B;&#x306A;&#x308B;<b>zlib</b>&#x30EC;&#x30D9;&#x30EB;&#x306E;&#x5024;&#x3088;&#x308A;&#x4E0A;&#x3067;&#x3042;&#x308B;&#x3068;&#x307F;&#x306A;&#x3055;&#x308C;&#x308B;&#x3002; &#x5F93;&#x3063;&#x3066;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x3068;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x3044;&#x305A;&#x308C;&#x304B;&#x304C;<b>bzip2</b>&#x30EC;&#x30D9;&#x30EB;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001; &#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306F;<b>zlib</b>&#x3092;&#x9078;&#x629E;&#x3059;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x5727;&#x7E2E;&#x30EC;&#x30D9;&#x30EB;&#x306F;&quot;<code>zlib:6</code>&quot;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p><b>bzip2</b>&#x5727;&#x7E2E;&#x306E;&#x52D5;&#x4F5C;&#x65B9;&#x5F0F;&#x3068;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30FC;&#x30B5;&#x30A4;&#x30BA;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001; <b>bzip2</b>&#x306F;&#x9023;&#x7D9A;&#x7684;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x30E0;&#x304C;&#x6D41;&#x308C;&#x308B;&#x5834;&#x5408;&#x306B;&#x3060;&#x3051;&#x4F7F;&#x3046;&#x610F;&#x5473;&#x304C;&#x3042;&#x308B;&#x3002; &#x901A;&#x5E38;&#x306E;<b>telnet</b>&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x3088;&#x3046;&#x306A;&#x3001;&#x5C0F;&#x3055;&#x306A;&#x8EE2;&#x9001;&#x3067;&#x306F;<b>zlib</b>&#x306E;&#x65B9;&#x304C;&#x6027;&#x80FD;&#x304C;&#x3088;&#x3044;&#x3002; &#x3069;&#x3061;&#x3089;&#x304C;&#x3042;&#x306A;&#x305F;&#x306B;&#x3068;&#x3063;&#x3066;&#x3088;&#x304F;&#x50CD;&#x304F;&#x304B;&#x306F;&#x3001;&#x5B9F;&#x9A13;&#x3057;&#x3066;&#x307F;&#x306A;&#x3044;&#x3068;&#x308F;&#x304B;&#x3089;&#x306A;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002; &#x52A0;&#x3048;&#x3066;&#x3001;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30FC;&#x30B5;&#x30A4;&#x30BA;&#x304C;&#x5C0F;&#x3055;&#x3044;&#x306E;&#x3067;&#x3001;<b>bzip2</b>&#x306E;1&#x3088;&#x308A;&#x4E0A;&#x304B;&#x3089;&#x306F;&#x5F97;&#x308B;&#x3082;&#x306E;&#x304C;&#x306A;&#x3044;&#x3002; <b>Zebedee</b>&#x306F;&#x3053;&#x308C;&#x3088;&#x308A;&#x4E0A;&#x306E;&#x5024;&#x306F;&#x3053;&#x306E;&#x5024;&#x306B;&#x5909;&#x66F4;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>verbosity level&#x3092;2&#x4EE5;&#x4E0A;&#x306B;&#x3059;&#x308C;&#x3070;&#x3001; &#x63A5;&#x7D9A;&#x304C;&#x7D42;&#x4E86;&#x3057;&#x305F;&#x6642;&#x306B;&#x57FA;&#x672C;&#x7684;&#x306A;&#x7D71;&#x8A08;&#x5024;&#x304C;&#x30D7;&#x30EA;&#x30F3;&#x30C8;&#x30A2;&#x30A6;&#x30C8;&#x3055;&#x308C;&#x308B;&#x306E;&#x3067;&#x3001; &#x3069;&#x308C;&#x3060;&#x3051;&#x5727;&#x7E2E;&#x304C;&#x6709;&#x52B9;&#x3060;&#x3063;&#x305F;&#x304B;&#x6B63;&#x78BA;&#x306B;&#x77E5;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> zebedee(232/210):   read 166 bytes (265 expanded) in 3 messages
 zebedee(232/210):   wrote 20969 bytes (30499 expanded) in 247 messages</code></pre>

</dd>
<dt id="generator"><b>generator</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;Diffie-Hellman&#x30AD;&#x30FC;&#x4EA4;&#x63DB;&#x306E;&quot;generator&quot;&#x3067;&#x3001;16&#x9032;&#x6570;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3067;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;&quot;2&quot;&#x3067;&#x3042;&#x308B;&#x3002; &#x306A;&#x3093;&#x306E;&#x3053;&#x3068;&#x304B;&#x308F;&#x304B;&#x3089;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001; &#x4E0B;&#x624B;&#x306B;&#x3044;&#x3058;&#x3089;&#x306A;&#x3044;&#x65B9;&#x304C;&#x3044;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

</dd>
<dt id="keygencommand"><b>keygencommand</b></dt>
<dd>

<p>&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001; &#x3053;&#x306E;&#x5024;(&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x6587;&#x5B57;&#x5217;)&#x304C;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002; &#x305D;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x306F;&#x6A19;&#x6E96;&#x51FA;&#x529B;&#x306B;1&#x884C;&#x306E;16&#x9032;&#x6570;&#x3092;&#x51FA;&#x529B;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002; &#x3053;&#x306E;&#x884C;&#x306F;&#x5C11;&#x304F;&#x3068;&#x3082;10&#x6841;&#x306E;16&#x9032;&#x6570;&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x3002;</p>
</P>

</dd>
<dt id="keygenlevel"><b>keygenlevel</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;0&#x3068;2&#x306E;&#x9593;&#x306E;&#x6574;&#x6570;&#x3067;&#x3001;<b>Zebedee</b>&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x79D8;&#x5BC6;&#x9375;&#x751F;&#x6210;&#x306E;&#x5F37;&#x5EA6;&#x3092;&#x6C7A;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;2(&#x6700;&#x5F37;)&#x3067;&#x3042;&#x308B;&#x3002;&#x63A5;&#x7D9A;&#x6642;&#x306E;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x304C;&#x8010;&#x3048;&#x304C;&#x305F;&#x3044;&#x5834;&#x5408;&#x4EE5;&#x5916;&#x306B;&#x306F;&#x3001; &#x4E00;&#x822C;&#x7684;&#x306B;&#x306F;&#x3053;&#x308C;&#x3092;&#x5909;&#x66F4;&#x3057;&#x306A;&#x3044;&#x307B;&#x3046;&#x304C;&#x3088;&#x3044;&#x3002;</p>
</P>

<p>&#x7C21;&#x5358;&#x306B;&#x8A00;&#x3063;&#x3066;&#x3001;UNXI&#x7CFB;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x30EC;&#x30D9;&#x30EB;2&#x306E;&#x30AD;&#x30FC;&#x751F;&#x6210;&#x306E;&#x30E1;&#x30AB;&#x30CB;&#x30BA;&#x30E0;&#x306F;&#x3001; &#x53EF;&#x80FD;&#x3067;&#x3042;&#x308C;&#x3070; <code>/dev/random</code> &#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001;&#x3042;&#x307E;&#x308A;&#x306B;&#x3082;&#x591A;&#x304F;&#x306E;&#x8981;&#x6C42;&#x3092;&#x9023;&#x7D9A;&#x7684;&#x306B;&#x3053;&#x306E;&#x30C7;&#x30D0;&#x30A4;&#x30B9;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x884C;&#x3046;&#x3068;&#x3001; &#x30AB;&#x30FC;&#x30CD;&#x30EB;&#x304C;&#x5FC5;&#x8981;&#x306A;&quot;&#x30A8;&#x30F3;&#x30C8;&#x30ED;&#x30D4;&#x30FC;&quot;&#x3092;&#x304B;&#x304D;&#x96C6;&#x3081;&#x308B;&#x9593;&#x3001; &#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x304C;&#x30D6;&#x30ED;&#x30C3;&#x30AF;&#x3055;&#x308C;&#x308B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;(&#x305D;&#x308C;&#x304C;&#x6570;&#x79D2;&#x306B;&#x306A;&#x308B;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;)&#x3002; <code>/dev/random</code>&#x304C;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x306A;&#x3044;&#x5834;&#x5408;&#x3084; &#x30EC;&#x30D9;&#x30EB;&#x304C;1&#x306B;&#x30BB;&#x30C3;&#x30C8;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001; <code>/proc</code>&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306E;&#x73FE;&#x5728;&#x306E;&#x5185;&#x5BB9;&#x304C;(&#x3082;&#x3057;&#x3042;&#x308C;&#x3070;)&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002; &#x30EC;&#x30D9;&#x30EB;0&#x3067;&#x306F;&#x73FE;&#x5728;&#x306E;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x306B;&#x3042;&#x308B;&#x60C5;&#x5831;&#x3060;&#x3051;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>Windows&#x4E0A;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x3001;&#x73FE;&#x5728;&#x306E;&#x3068;&#x3053;&#x308D;&#x3001; &#x30AD;&#x30FC;&#x751F;&#x6210;&#x5F37;&#x5EA6;&#x306E;&#x30EC;&#x30D9;&#x30EB;&#x3054;&#x3068;&#x306E;&#x9055;&#x3044;&#x306F;&#x306A;&#x304F;&#x3001; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x5B9F;&#x969B;&#x306B;&#x306F;&#x7121;&#x8996;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="keylength--k"><b>keylength</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-k</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;Blowfish&#x6697;&#x53F7;&#x5316;&#x306E;&#x30AD;&#x30FC;&#x306E;&#x30D3;&#x30C3;&#x30C8;&#x9577;&#x306E;&#x6700;&#x5927;&#x5024;&#x306E;&#x6574;&#x6570;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x5024;&#x306F;4&#x304B;&#x3089;576&#x306E;&#x9593;&#x306E;4&#x306E;&#x500D;&#x6570;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002; &#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x30AD;&#x30FC;&#x9577;&#x306F;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x5024;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x5024;&#x306E;&#x6700;&#x5C0F;&#x5024;&#x306B;&#x306A;&#x308B;&#x3002; (<b><a href="#item_minkeylength">minkeylength</a></b>&#x53C2;&#x7167;)</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;128&#x3067;&#x3042;&#x308B;&#x3002; &#x7279;&#x5225;&#x306A;&#x30B1;&#x30FC;&#x30B9;&#x3068;&#x3057;&#x3066;&#x3001;&#x3053;&#x306E;&#x5024;&#x304C;0&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001; &#x30AD;&#x30FC;&#x306E;&#x30CD;&#x30B4;&#x30B7;&#x30A8;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x6697;&#x53F7;&#x5316;&#x306F;&#x7121;&#x52B9;&#x306B;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="keylifetime"><b>keylifetime</b></dt>
<dd>

<p>&#x3053;&#x306E;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306E;&#x5024;&#x304C;0&#x4EE5;&#x5916;&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x3053;&#x308C;&#x4EE5;&#x964D;&#x306E;&#x63A5;&#x7D9A;&#x306B;&#x304A;&#x3044;&#x3066;&#x3001; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x30AD;&#x30FC;&#x306E;&#x5C0E;&#x51FA;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x4EE5;&#x524D;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x305F;shared secret key&#x3092; &#x518D;&#x5229;&#x7528;&#x3059;&#x308B;&#x3088;&#x3046;&#x306B;&#x8981;&#x6C42;&#x3059;&#x308B;&#x3002; &#x3064;&#x307E;&#x308A;<b>Zebedee</b>&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3001; &#x6700;&#x521D;&#x306E;&#x63A5;&#x7D9A;&#x306B;&#x304A;&#x3044;&#x3066;&#x306E;&#x307F;&#x30AD;&#x30FC;&#x4EA4;&#x63DB;&#x306E;&#x5BFE;&#x8A71;&#x3092;&#x5168;&#x3066;&#x884C;&#x306A;&#x3046;&#x3002; &#x305D;&#x308C;&#x4EE5;&#x964D;&#x306E;&#x63A5;&#x7D9A;&#x3067;&#x306F;&#x3001;&#x30AD;&#x30FC;&#x306E;&#x6709;&#x52B9;&#x671F;&#x9650;&#x304C;&#x5207;&#x308C;&#x308B;&#x307E;&#x3067;&#x306F;&#x3001;&#x540C;&#x3058;secret key&#x304C;&#x518D;&#x5229;&#x7528;&#x3055;&#x308C;&#x3001; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x304B;&#x3089;session key&#x304C;&#x5C0E;&#x51FA;&#x3055;&#x308C;&#x308B;&#x3002; &#x30AD;&#x30FC;&#x306E;&#x6709;&#x52B9;&#x671F;&#x9650;&#x304C;&#x5207;&#x308C;&#x308B;&#x3068;&#x3001;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x65B0;&#x3057;&#x3044;&#x30AD;&#x30FC;&#x306E;&#x4EA4;&#x63DB;&#x304C;&#x884C;&#x306A;&#x308F;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x305D;&#x3057;&#x3066;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x3001;shared secret key&#x304C;&#x6709;&#x52B9;&#x306A;&#x671F;&#x9593;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x3001;&#x65E2;&#x306B;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x305F;&#x63A5;&#x7D9A;&#x306B;&#x306F;&#x5F71;&#x97FF;&#x3057;&#x306A;&#x3044;&#x3067;&#x3001;&#x65B0;&#x3057;&#x3044;&#x63A5;&#x7D9A;&#x3060;&#x3051;&#x306B;&#x5F71;&#x97FF;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x5024;&#x306E;&#x5358;&#x4F4D;&#x306F;&#x79D2;&#x3067;&#x3042;&#x308A;&#x3001;65535(&#x7D04;18&#x6642;&#x9593;)&#x4EE5;&#x4E0B;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;3600&#x79D2;(1&#x6642;&#x9593;)&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x5024;&#x3092;0&#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;&#x30AD;&#x30FC;&#x306E;&#x518D;&#x5229;&#x7528;&#x306F;&#x884C;&#x306A;&#x308F;&#x308C;&#x306A;&#x304F;&#x306A;&#x308A;&#x3001; &#x63A5;&#x7D9A;&#x306E;&#x5EA6;&#x306B;&#x3001;&#x5B8C;&#x5168;&#x306A;shared key&#x306E;&#x4EA4;&#x63DB;&#x624B;&#x7D9A;&#x304D;&#x304C;&#x884C;&#x306A;&#x308F;&#x308C;&#x308B;&#x3002; &#x3064;&#x307E;&#x308A;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3082;&#x30B5;&#x30FC;&#x30D0;&#x3082;&#x6BCE;&#x56DE;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x65B0;&#x3057;&#x304F;&#x751F;&#x6210;&#x3059;&#x308B;&#x3068;&#x307F;&#x306A;&#x3059;&#x3002; &#x305F;&#x3060;&#x3057;&#x3001;&#x3053;&#x306E;&#x65B9;&#x6CD5;&#x306F;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x306B;&#x591A;&#x5927;&#x306A;&#x5F71;&#x97FF;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001; &#x504F;&#x57F7;&#x72C2;&#x7684;&#x306B;&#x9AD8;&#x5EA6;&#x306A;&#x5B89;&#x5168;&#x6027;&#x3092;&#x5FC5;&#x8981;&#x3068;&#x3059;&#x308B;&#x5834;&#x5408;&#x4EE5;&#x5916;&#x306B;&#x306F;&#x52E7;&#x3081;&#x3089;&#x308C;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="minkeylength"><b>minkeylength</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x307E;&#x305F;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x3067;&#x8A31;&#x5BB9;&#x3055;&#x308C;&#x308B;&#x6700;&#x5C0F;&#x306E;&#x30AD;&#x30FC;&#x9577;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x30EC;&#x30D9;&#x30EB;&#x3088;&#x308A;&#x5C0F;&#x3055;&#x3044;&#x5024;&#x3092;&#x8981;&#x6C42;&#x3059;&#x308B;&#x3068;&#x3001; &#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3053;&#x3053;&#x3067;&#x6307;&#x5B9A;&#x3057;&#x305F;&#x6700;&#x5C0F;&#x5024;&#x3092;&#x8FD4;&#x7B54;&#x3059;&#x308B;&#x3002; &#x30B5;&#x30FC;&#x30D0;&#x304C;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x6700;&#x5C0F;&#x5024;&#x3088;&#x308A;&#x4E0B;&#x306E;&#x30EC;&#x30D9;&#x30EB;&#x3092;&#x8FD4;&#x7B54;&#x3059;&#x308B;&#x3068;&#x3001; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x63A5;&#x7D9A;&#x3092;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;0&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="modulus"><b>modulus</b></dt>
<dd>

<p>&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306E;&#x5024;&#x306F;&#x3001;Diffie-Hellman&#x30AD;&#x30FC;&#x4EA4;&#x63DB;&#x306E;&#x5270;&#x4F59;&#x5024;&#x3092;&#x8868;&#x3059;16&#x9032;&#x6570;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x304C;&#x4F55;&#x304B;&#x308F;&#x304B;&#x308B;&#x4EBA;&#x3067;&#x6570;&#x5B66;&#x30AA;&#x30BF;&#x30AF;&#x306E;&#x4EBA;&#x4EE5;&#x5916;&#x306F;&#x3044;&#x3058;&#x3063;&#x3061;&#x3083;&#x3060;&#x3081;&#x3002;</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306E;&#x5024;&#x306F;&#x4E0B;&#x8A18;&#x306E;1024&#x30D3;&#x30C3;&#x30C8;&#x306E;&#x7D20;&#x6570;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<pre><code> f488fd584e49dbcd 20b49de49107366b 336c380d451d0f7c 88b31c7c5b2d8ef6
 f3c923c043f0a55b 188d8ebb558cb85d 38d334fd7c175743 a31d186cde33212c
 b52aff3ce1b12940 18118d7c84a70a72 d686c40319c80729 7aca950cd9969fab
 d00a509b0246d308 3d66a45d419f9c7c bd894b221926baab a25ec355e92f78c7</code></pre>

<p>&#x3053;&#x308C;&#x306F; Peter Gutman &#x306E; <b>CryptLib</b> &#x306E;&#x4E2D;&#x306E; <i>testdh.h</i> &#x3068;&#x3044;&#x3046;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304B;&#x3089; &#x3068;&#x3089;&#x308C;&#x305F;&#x3002; &#x305D;&#x3053;&#x306B;&#x306F;&#x3001;&#x3053;&#x306E;&#x5024;&#x304C; &quot;generated by Colin Plumb for SKIP&quot;&#x3060;&#x3068;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x304C;&#x3042;&#x308B;&#x3002; &#x305D;&#x308C;&#x304B;&#x3089; &quot;these values were chosen as representative well-known public values to allay fears of possible trapdoors in self-generated values. The generation method and actual values can be checked against the SKIP standards document.&quot; &#x3060;&#x3068;&#x3055;&#x3002;</p>
</P>

</dd>
<dt id="privatekey"><b>privatekey</b></dt>
<dd>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;<b>Zebedee</b>&#x306F;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3054;&#x3068;&#x306B;&#x65B0;&#x3057;&#x3044;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x3082;&#x3057;&#x3042;&#x306A;&#x305F;&#x304C;&#x6BCE;&#x56DE;&#x540C;&#x3058;&#x30AD;&#x30FC;&#x3092;&#x4F7F;&#x3044;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001; 16&#x9032;&#x6570;&#x306E;&#x6587;&#x5B57;&#x5217;&#x3068;&#x3057;&#x3066;&#x3053;&#x308C;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308C;&#x3070;&#x3044;&#x3044;&#x3002; &#x3082;&#x3057;&#x516C;&#x958B;&#x9375;&#x6697;&#x53F7;&#x306B;&#x3088;&#x308B;&#x8A8D;&#x8A3C;(<a>identitychecking</a>)&#x3092;&#x4F7F;&#x7528;&#x3057;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001; &#x5FC5;&#x305A;&#x3053;&#x308C;&#x3092;&#x8A2D;&#x5B9A;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002; &#x30AD;&#x30FC;&#x304C;&#x5C11;&#x304F;&#x3068;&#x3082;10&#x6841;&#x306F;&#x5FC5;&#x8981;&#x306A;&#x3053;&#x3068;&#x306B;&#x6CE8;&#x610F;&#x3059;&#x308B;&#x3053;&#x3068;&#x3002;</p>
</P>

</dd>
</dl>

<h3 id="Miscellaneous-Keywords">&#x69D8;&#x3005;&#x306A;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;(Miscellaneous Keywords)</h3>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306F;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306B;&#x3082;&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x3082;&#x7B49;&#x3057;&#x304F;&#x9069;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="checkidfile"><b>checkidfile</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x63A5;&#x7D9A;&#x3092;&#x8A31;&#x53EF;&#x3059;&#x308B;&#x524D;&#x306B;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x3092;&#x8907;&#x6570;&#x8A18;&#x8FF0;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x79F0;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;<a>identity checking</a>&#x3067;&#x8A73;&#x3057;&#x304F;&#x8FF0;&#x3079;&#x308B;&#x3002; &#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x3072;&#x3068;&#x3064;&#x3057;&#x304B;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;&#x3082;&#x3057;&#x8907;&#x6570;&#x51FA;&#x73FE;&#x3057;&#x305F;&#x3089;&#x3001; &#x6700;&#x5F8C;&#x306E;&#x5024;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x3082;&#x3057;&#x3001;<b><a href="#item_keylength">keylength</a></b>&#x304C;0&#x3067;&#x3042;&#x308B;&#x3053;&#x3068;&#x306B; (&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x304C;)&#x540C;&#x610F;&#x3057;&#x305F;&#x5834;&#x5408;&#x306F;&#x3001;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x306E;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x306F;&#x884C;&#x306A;&#x308F;&#x308C;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="debug--D"><b>debug</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-D</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;<b>Zebedee</b>&#x304C; &quot;debug&quot; &#x30E2;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x304B;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x771F;&#x507D;&#x5024;&#x3067;&#x3042;&#x308B;&#x3002; &quot;debug&quot; &#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x306F; (<b><a href="#item_multiuse">multiuse</a></b>&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;)&#x306F; &#x4E00;&#x5EA6;&#x306B;&#x4E00;&#x3064;&#x306E;&#x63A5;&#x7D9A;&#x3057;&#x304B;&#x53D7;&#x3051;&#x4ED8;&#x3051;&#x306A;&#x3044;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;&#x5225;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3084;&#x5225;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x306A;&#x304F; &quot;inline&quot; &#x3067;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x30C7;&#x30D0;&#x30C3;&#x30AC;&#x4E0A;&#x3067;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x52D5;&#x304B;&#x3059;&#x6642;&#x306B;&#x4FBF;&#x5229;&#x3067;&#x3042;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;false&#x3067;&#x3042;&#x308B;&#x3002;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E; <b>-D</b> &#x306F; &#x3053;&#x308C;&#x3092; <b>true</b> &#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x306E;&#x3068;&#x540C;&#x3058;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x6CE8;&#xFF1A;&#x3053;&#x306E;&#x8A2D;&#x5B9A;&#x306F;&#x3001;UDP&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;&#x6B63;&#x3057;&#x304F;&#x52D5;&#x4F5C;&#x3057;&#x306A;&#x3044;&#x306E;&#x3067;&#x3001;&#x8A66;&#x3055;&#x306A;&#x3044;&#x307B;&#x3046;&#x304C;&#x3044;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="detached--d"><b>detached</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-d</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x304C;&#x5236;&#x5FA1;&#x7AEF;&#x672B;&#x304B;&#x3089;&#x81EA;&#x5206;&#x81EA;&#x8EAB;&#x3092;&#x5207;&#x96E2;&#x3057;&#x3066;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C8;&#x3067; (UNIX&#x7528;&#x8A9E;&#x3067;&#x306F;&#x30C7;&#x30FC;&#x30E2;&#x30F3;&#x3068;&#x3057;&#x3066;)&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x771F;&#x507D;&#x5024;&#x3067;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3067;&#x3082;&#x30B5;&#x30FC;&#x30D0;&#x3067;&#x3082;&#x6709;&#x52B9;&#x3067;&#x3042;&#x308A;&#x3001; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F; <b>true</b> &#x3067;&#x3042;&#x308B;&#x3002;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;<b>-d</b>&#x306F; &#x3053;&#x308C;&#x3092; <b>false</b> &#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x306E;&#x3068;&#x540C;&#x3058;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x6CE8;&#xFF1A;Windows&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x3067;&#x306F;&#x3053;&#x308C;&#x304C;&#x3046;&#x307E;&#x304F;&#x52D5;&#x4F5C;&#x3057;&#x306A;&#x3044;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3088;&#x3046;&#x3060;&#x3002; &#x305D;&#x306E;&#x5FB4;&#x5019;&#x306F;&#x3001;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x30A6;&#x30A4;&#x30F3;&#x30C9;&#x30A6;&#x3078;&#x306E;&#x51FA;&#x529B;&#x304C;&#x6B62;&#x307E;&#x308A;&#x5272;&#x8FBC;&#x307F;&#x306E;signal&#x304C;&#x7121;&#x8996;&#x3055;&#x308C;&#x308B;&#x304C;&#x3001; &#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x306E;&#x30D7;&#x30ED;&#x30F3;&#x30D7;&#x30C8;&#x304C;<b>Zebedee</b>&#x304C;&#x7D42;&#x4E86;&#x3059;&#x308B;&#x307E;&#x3067;&#x8868;&#x793A;&#x3055;&#x308C;&#x306A;&#x3044;&#x3053;&#x3068;&#x3060;&#x3002; &#x3053;&#x308C;&#x3092;&#x56DE;&#x907F;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B; &quot;start&quot; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;</p>
</P>

<pre><code> DOS&gt; start zebedee -f server.zbd</code></pre>

<p>&#x3053;&#x308C;&#x306F;<b>Zebedee</b>&#x3092;&#x65B0;&#x3057;&#x3044;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x8D77;&#x52D5;&#x3057;&#x3001;&#x305D;&#x3053;&#x304B;&#x3089;&#x5207;&#x308A;&#x96E2;&#x3059;&#x3002; &#x5207;&#x308A;&#x96E2;&#x3059;&#x524D;&#x306B;&#x4E00;&#x77AC;&#x3060;&#x3051;&#x30C1;&#x30E9;&#x30EA;&#x3068;&#x305D;&#x306E;&#x30B3;&#x30F3;&#x30BD;&#x30FC;&#x30EB;&#x304C;&#x898B;&#x3048;&#x308B;&#x304C;&#x3001;&#x305D;&#x308C;&#x304C;&#x6D88;&#x3048;&#x3066;&#x3082; <b>Zebedee</b>&#x306F;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="include"><b>include</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x5225;&#x306E;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x6B8B;&#x308A;&#x3092;&#x51E6;&#x7406;&#x3059;&#x308B;&#x524D;&#x3001; &#x3053;&#x306E;&#x6642;&#x70B9;&#x3067;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x3082;&#x3063;&#x3068;&#x304D;&#x3063;&#x3061;&#x308A;&#x30AC;&#x30FC;&#x30C9;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5206;&#x96E2;&#x3057;&#x3066;&#x4FDD;&#x5B58;&#x3057;&#x305F;&#x5834;&#x5408;&#x306B;&#x3001; &#x305D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x53D6;&#x308A;&#x8FBC;&#x3080;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002; include&#x306F;5&#x30EC;&#x30D9;&#x30EB;&#x306E;&#x6DF1;&#x3055;&#x307E;&#x3067;&#x306B;&#x9650;&#x5B9A;&#x3055;&#x308C;&#x308B;(&#x6700;&#x521D;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30EC;&#x30D9;&#x30EB;1&#x3068;&#x3057;&#x3066;)&#x3002; &#x3053;&#x308C;&#x306F;&#x3046;&#x3063;&#x304B;&#x308A;&#x7121;&#x9650;&#x30EB;&#x30FC;&#x30D7;&#x3092;&#x4F5C;&#x3089;&#x306A;&#x3044;&#x305F;&#x3081;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="maxbufsize"><b>maxbufsize</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001; <b>Zebedee</b> &#x304C;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304B;&#x3089;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x8AAD;&#x3080;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x9577;&#x3055;(&#x30D0;&#x30A4;&#x30C8;&#x5358;&#x4F4D;)&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x5B9F;&#x969B;&#x306B;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x306E;&#x9577;&#x3055;&#x306F;&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x5024;&#x3068;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x5024;&#x306E;&#x6700;&#x5C0F;&#x5024;&#x306B;&#x306A;&#x308B;&#x3002;</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;<b>Zebedee</b>&#x306F;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306E;&#x4E21;&#x7AEF;&#x3067; &#x30B5;&#x30FC;&#x30D0;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x304B;&#x3089;8192&#x30D0;&#x30A4;&#x30C8;&#x5358;&#x4F4D;&#x3067;&#x8AAD;&#x307F;&#x51FA;&#x3059;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;&#x3059;&#x3054;&#x304F;&#x5BFE;&#x8A71;&#x7684;&#x306A;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x3042;&#x3063;&#x3066;&#x3001; &#x5927;&#x304D;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x8EE2;&#x9001;&#x3092;&#x5F85;&#x3064;&#x305F;&#x3081;&#x306B;&#x3072;&#x3069;&#x3044;&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x3060;&#x3063;&#x305F;&#x308A;&#x3057;&#x305F;&#x6642;&#x306A;&#x3069;&#x3001; &#x3053;&#x308C;&#x3092;&#x5C0F;&#x3055;&#x304F;&#x3057;&#x305F;&#x3044;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; &#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30B5;&#x30A4;&#x30BA;&#x306F;1&#x30D0;&#x30A4;&#x30C8;&#x307E;&#x3067;&#x7E2E;&#x3081;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x304C;&#x3001; &#x304A;&#x304B;&#x3057;&#x306A;&#x52D5;&#x304D;&#x3092;&#x30C7;&#x30D0;&#x30C3;&#x30B0;&#x3057;&#x3088;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x304B;&#x6642;&#x9593;&#x3092;&#x7121;&#x99C4;&#x306B;&#x3057;&#x305F;&#x3044;&#x306E;&#x3067;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001; &#x3053;&#x308C;&#x306F;&#x304A;&#x52E7;&#x3081;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002; &#x9006;&#x306B;&#x3001;&#x5927;&#x91CF;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x8EE2;&#x9001;&#x304C;&#x3042;&#x3063;&#x3066;&#x3001; &#x5727;&#x7E2E;&#x3092;&#x3081;&#x3044;&#x3063;&#x3071;&#x3044;&#x52B9;&#x304B;&#x305B;&#x305F;&#x3044;&#x5834;&#x5408;&#x306F;&#x3001;16383&#x30D0;&#x30A4;&#x30C8;&#x307E;&#x3067;&#x5927;&#x304D;&#x304F;&#x3057;&#x3066;&#x3082;&#x3088;&#x3044;&#x3002; &#x6CE8;&#xFF1A;<b>maxbufsize</b> &#x306F; <b>Zebedee</b> &#x304C;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x30E1;&#x30E2;&#x30EA;&#x91CF;&#x306B;&#x306F;&#x95A2;&#x4FC2;&#x306A;&#x3044;&#x3002; &#x4E00;&#x5EA6;&#x306B;&#x8AAD;&#x307F;&#x3053;&#x3080;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x304B;&#x305F;&#x307E;&#x308A;&#x306E;&#x30B5;&#x30A4;&#x30BA;&#x3060;&#x3051;&#x306B;&#x5F71;&#x97FF;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>UDP&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;&#x3001;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30B5;&#x30A4;&#x30BA;&#x306F;&#x6271;&#x3048;&#x308B;&#x30C7;&#x30FC;&#x30BF;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x6700;&#x5927;&#x9577;&#x306B;&#x3082;&#x5F71;&#x97FF;&#x3059;&#x308B;&#x3002; &#x73FE;&#x5728;&#x306E;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30B5;&#x30A4;&#x30BA;&#x3088;&#x308A;&#x5927;&#x304D;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x5206;&#x65AD;&#x3055;&#x308C;&#x3001; &#x305D;&#x308C;&#x3092;&#x53D7;&#x4FE1;&#x3059;&#x308B;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x843D;&#x3061;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x308A;&#x304C;&#x3061;&#x3060;&#x3002; 16383&#x30D0;&#x30A4;&#x30C8;&#x4EE5;&#x4E0A;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x6271;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="message"><b>message</b></dt>
<dd>

<p>verbosity level &#x304C;1&#x306A;&#x3089;&#x3070;&#x3001;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x3053;&#x306E;&#x90E8;&#x5206;&#x3092;&#x51E6;&#x7406;&#x3057;&#x305F;&#x6642;&#x306B;&#x3001; &#x3053;&#x306E;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;&#x30ED;&#x30B0;&#x306B;&#x8A18;&#x9332;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="name--n"><b>name</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-n</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x5B9F;&#x884C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x306E;&#x4EE3;&#x308F;&#x308A;&#x306B;&#x3001; &#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306E;&#x4E2D;&#x3067;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x540D;&#x79F0;&#x306B;&#x306A;&#x308B;&#x3002; Windows&#x74B0;&#x5883;&#x3067;&#x306F;&#x3001;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3042;&#x308B;&#x3044;&#x306F;&#x524A;&#x9664;&#x3055;&#x308C;&#x308B;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x540D;&#x524D;&#x3068;&#x3057;&#x3066;&#x3082;&#x7528;&#x3044;&#x3089;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="logfile-command-line--o"><b>logfile</b> (command-line <b>-o</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x304C;&#x51FA;&#x529B;&#x3055;&#x308C;&#x308B;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x3067;&#x3042;&#x308B;&#x3002; &#x3082;&#x3057;&#x7701;&#x7565;&#x3055;&#x308C;&#x308B;&#x3068;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x6A19;&#x6E96;&#x30A8;&#x30E9;&#x30FC;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>2&#x3064;&#x306E;&#x7279;&#x6B8A;&#x306A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3082;&#x6B63;&#x3057;&#x3044;&#x540D;&#x524D;&#x3068;&#x3057;&#x3066;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;&#x540D;&#x79F0;&#x304C;<b>NULL</b>&#x3060;&#x3068;&#x3001;&#x5168;&#x3066;&#x306E;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x51FA;&#x529B;&#x306F;&#x6B62;&#x3081;&#x3089;&#x308C;&#x308B;&#x3002; <b>SYSLOG</b>&#x3060;&#x3068;&#x3001;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x30DB;&#x30B9;&#x30C8;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x30ED;&#x30B0;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x308B;&#x3002; Windows&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x30A4;&#x30D9;&#x30F3;&#x30C8;&#x30ED;&#x30B0;&#x3092;&#x610F;&#x5473;&#x3059;&#x308B;&#x3002; &#x4ED6;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F;&#x3001;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;<b>syslog</b> &#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="serverport"><b>serverport</b></dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;<b>Zebedee</b> &#x30B5;&#x30FC;&#x30D0;&#x304C;&#x63A5;&#x7D9A;&#x3092;&#x5F85;&#x3061;&#x53D7;&#x3051;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x3042;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;TCP&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;11965 (0x2EBD)&#x3001;UDP&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x306F;11230(0x2BDE)&#x3067;&#x3042;&#x308B;&#x3002; &#x30B5;&#x30FC;&#x30D0;&#x3067;&#x3053;&#x308C;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3053;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x3067;listen&#x3059;&#x308B;&#x3002; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3067;&#x3053;&#x308C;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3068;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F; &#x30B5;&#x30FC;&#x30D0;&#x306E;&#x3053;&#x306E;&#x756A;&#x53F7;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x306B;&#x306A;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="timestamplog--t"><b>timestamplog</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-t</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x30ED;&#x30B0;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306B;&#x30BF;&#x30A4;&#x30E0;&#x30B9;&#x30BF;&#x30F3;&#x30D7;&#x3092;&#x542B;&#x3081;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x3092;&#x793A;&#x3059;&#x771F;&#x507D;&#x5024;&#x3067;&#x3042;&#x308B;&#x3002; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E; <b>-t</b> &#x306F;&#x3053;&#x308C;&#x3092;<b>true</b>&#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x306E;&#x3068;&#x540C;&#x3058;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="udpmode--u"><b>udpmode</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-u</b>)</dt>
<dd>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;<b>Zebedee</b>&#x306F;&#x3001;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x30D9;&#x30FC;&#x30B9;&#x306E;TCP/IP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x6271;&#x3046;&#x3002; &#x3082;&#x3057;&#x3001;&#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x6307;&#x5B9A;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x304B;&#x308F;&#x308A;&#x306B;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x30EC;&#x30B9;&#x306E;UDP/IP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x6271;&#x3046;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x5834;&#x5408;&#x3067;&#x3082;&#x3001;<b>Zebedee</b>&#x306E;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3068;&#x30B5;&#x30FC;&#x30D0;&#x9593;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306F;TCP/IP&#x63A5;&#x7D9A;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3002; UDP&#x306E;&#x5B9B;&#x5148;&#x3054;&#x3068;&#x306B;&#x5225;&#x3005;&#x306E;&#x63A5;&#x7D9A;&#x304C;&#x4F7F;&#x7528;&#x3055;&#x308C;&#x308B;&#x3002; UDP&#x306F;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x30EC;&#x30B9;&#x306A;&#x306E;&#x3067;&#x3001;&#x901A;&#x4FE1;&#x304C;&#x5B8C;&#x4E86;&#x3057;&#x305F;&#x3053;&#x3068;&#x3092;&#x7C21;&#x5358;&#x306B;&#x77E5;&#x308B;&#x3053;&#x3068;&#x306F;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002; &#x3053;&#x306E;&#x7406;&#x7531;&#x3067;&#x3001;<b>Zebedee</b>&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x4E00;&#x5B9A;&#x306E;&#x6642;&#x9593;&#x901A;&#x4FE1;&#x304C;&#x7121;&#x3044;&#x5834;&#x5408;&#x306B;&#x30BF;&#x30A4;&#x30E0;&#x30A2;&#x30A6;&#x30C8;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x6642;&#x9593;&#x306F;<b><a href="#item_udptimeout">udptimeout</a></b>&#x306E;&#x5024;&#x3067;&#x5236;&#x5FA1;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x3059;&#x3067;&#x306B;&#x30BF;&#x30A4;&#x30E0;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3066;&#x3057;&#x307E;&#x3063;&#x305F;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306B;&#x5411;&#x3051;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x5230;&#x7740;&#x3057;&#x305F;&#x5834;&#x5408;&#x3001; &#x63A5;&#x7D9A;&#x3092;&#x518D;&#x78BA;&#x7ACB;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; &#x3053;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x7279;&#x6027;&#x306B;&#x3088;&#x3063;&#x3066;&#x306F;&#x3001; UDP&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x304C;&#x3088;&#x304F;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x898B;&#x3048;&#x308B;&#x3053;&#x3068;&#x3082;&#x3042;&#x308B;&#x3002; <b><a href="#item_keylifetime">keylifetime</a></b>&#x306E;&#x5024;&#x3092;&#x5909;&#x66F4;&#x3057;&#x3066;&#x3001; &#x63A5;&#x7D9A;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x306E;&#x6642;&#x9593;&#x3092;&#x6700;&#x5C0F;&#x306B;&#x3059;&#x308C;&#x3070;&#x3001;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x3092;&#x5411;&#x4E0A;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; <b><a href="#item_udptimeout">udptimeout</a></b> &#x306E;&#x5024;&#x3092;&#x5909;&#x66F4;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x540C;&#x69D8;&#x306B;&#x5F79;&#x306B;&#x7ACB;&#x3064;&#x3002;</p>
</P>

<p>&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;<b>-u</b>&#x306F;&#x3001;&#x3053;&#x306E;&#x5024;&#x3092;<b>true</b>&#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x306E;&#x3068;&#x540C;&#x3058;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="udptimeout"><b>udptimeout</b></dt>
<dd>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;UDP&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x306F;&#x3001;300&#x79D2;&#x901A;&#x4FE1;&#x304C;&#x7121;&#x3044;&#x3068;&#x9589;&#x3058;&#x3089;&#x308C;&#x308B;&#x3002; &#x3053;&#x306E;&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x305D;&#x306E;&#x6642;&#x9593;&#x3092;&#x5909;&#x66F4;&#x3067;&#x304D;&#x308B;(&#x5358;&#x4F4D;&#x306F;&#x79D2;)&#x3002; &#x3053;&#x306E;&#x5024;&#x306F;65535&#x3088;&#x308A;&#x5927;&#x304D;&#x304F;&#x306A;&#x3063;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002; &#x3053;&#x308C;&#x3092;0&#x306B;&#x3059;&#x308B;&#x3068;&#x4E00;&#x5207;&#x901A;&#x4FE1;&#x304C;&#x884C;&#x306A;&#x308F;&#x308C;&#x306A;&#x3044;(&#x305D;&#x3046;&#x3044;&#x3046;&#x8A2D;&#x5B9A;&#x3082;&#x3067;&#x304D;&#x308B;&#x3051;&#x3069;&hellip;)&#x3002;</p>
</P>

</dd>
<dt id="verbosity--v"><b>verbosity</b> (&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x306F; <b>-v</b>)</dt>
<dd>

<p>&#x3053;&#x308C;&#x306F;&#x3001;&#x30ED;&#x30B0;&#x3059;&#x308B;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306E;&#x30EC;&#x30D9;&#x30EB;&#x3092;&#x793A;&#x3059;&#x6574;&#x6570;&#x5024;&#x3067;&#x3042;&#x308B;&#x3002; 0&#x3060;&#x3068;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3060;&#x3051;&#x3001; 5&#x306B;&#x3059;&#x308B;&#x3068;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x306E;&#x975E;&#x5E38;&#x306B;&#x7D30;&#x304B;&#x3044;&#x30C7;&#x30A3;&#x30C6;&#x30FC;&#x30EB;&#x307E;&#x3067;&#x542B;&#x3081;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x306F;1&#x3067;&#x3042;&#x308A;&#x3001;&#x901A;&#x5E38;&#x306F;&#x305D;&#x308C;&#x304C;&#x6700;&#x3082;&#x4F7F;&#x3044;&#x3084;&#x3059;&#x3044;&#x3002;</p>
</P>

<p>&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F; <i>stderr</i> &#x306B;&#x51FA;&#x529B;&#x3055;&#x308C;&#x308B;(&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;<b>-o</b>&#x304B; <b><a href="#item_logfile">logfile</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3067;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3055;&#x308C;&#x306A;&#x3044;&#x9650;&#x308A;) &#x4E00;&#x822C;&#x7684;&#x306A;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x3053;&#x3093;&#x306A;&#x611F;&#x3058;&#x3067;&#x3042;&#x308B;:</p>
</P>

<pre><code> zebedee(54/119):  Listening on local port 1172</code></pre>

<p>&#x30AB;&#x30C3;&#x30B3;&#x306E;&#x4E2D;&#x306E;&#x6570;&#x5B57;&#x306F;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x3092;&#x51FA;&#x529B;&#x3057;&#x305F;&#x30D7;&#x30ED;&#x30BB;&#x30B9;&#x3068;&#x30B9;&#x30EC;&#x30C3;&#x30C9;&#x306E;ID&#x3092;&#x8868;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002; &#x5168;&#x3066;&#x306E;&#x30A8;&#x30E9;&#x30FC;&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x30EC;&#x30D9;&#x30EB;0&#x3067;&#x3082;&#x30ED;&#x30B0;&#x304C;&#x53D6;&#x3089;&#x308C;&#x3001; &#x4EE5;&#x4E0B;&#x306E;&#x69D8;&#x306B;&#x3001;&#x5148;&#x982D;&#x304C; <code>ERROR</code> &#x3068;&#x3044;&#x3046;&#x5358;&#x8A9E;&#x304B;&#x3089;&#x59CB;&#x307E;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee(54/119): ERROR: failed to connect to localhost:11965</code></pre>

<p>&#x30E1;&#x30C3;&#x30BB;&#x30FC;&#x30B8;&#x306F;&#x30ED;&#x30B0;&#x304C;&#x53D6;&#x3089;&#x308C;&#x305F;&#x30EC;&#x30D9;&#x30EB;&#x306B;&#x5F93;&#x3063;&#x3066;&#x30A4;&#x30F3;&#x30C7;&#x30F3;&#x30C8;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

</dd>
</dl>

<h3 id="Other-Options">&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;(Other Options)</h3>

<p>&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x5BFE;&#x5FDC;&#x3059;&#x308B;&#x3082;&#x306E;&#x3092;&#x6301;&#x305F;&#x306A;&#x3044;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3; &#x304C;&#x3044;&#x304F;&#x3064;&#x304B;&#x3042;&#x308B;&#x306E;&#x3067;&#x3001;&#x305D;&#x308C;&#x306B;&#x3064;&#x3044;&#x3066;&#x3053;&#x3053;&#x3067;&#x8AAC;&#x660E;&#x3059;&#x308B;&#x3002;</p>
</P>

<dl>

<dt id="p">-p</dt>
<dd>

<p>&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067; <b>Zebedee</b> &#x306F;&#x79D8;&#x5BC6;&#x9375;&#x306E;&#x5024;&#x3092;&#x6A19;&#x6E96;&#x51FA;&#x529B;&#x306B;&#x51FA;&#x529B;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x51FA;&#x529B;&#x306F;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3067;&#x305D;&#x306E;&#x307E;&#x307E;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x308B;&#x5F62;&#x5F0F;&#x3067;&#x3042;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> privatekey &quot;c480bd48f707c69dec54c9e7b6e22dd04cac659e&quot;</code></pre>

<p>&#x306E;&#x69D8;&#x306A;&#x5F62;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="P">-P</dt>
<dd>

<p>&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067; <b>Zebedee</b> &#x306F;<a>identity checking</a> &#x3067; &#x4F7F;&#x7528;&#x3067;&#x304D;&#x308B;&#x30D1;&#x30D6;&#x30EA;&#x30C3;&#x30AF;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3002;&#x7D50;&#x679C;&#x306F;&#x6A19;&#x6E96;&#x51FA;&#x529B;&#x306B;&#x66F8;&#x304B;&#x308C;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> ef8153a0e392df005f67321ca2f0ace5bb8c5a1f myhostname</code></pre>

<p>&#x306E;&#x69D8;&#x306A;&#x5F62;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x542B;&#x3080;&#x8A2D;&#x5B9A;&#x3068;&#x5171;&#x306B;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x304B;&#x3001; <b>-p</b> &#x3068;&#x5171;&#x306B;&#x7528;&#x3044;&#x3066;&#x79D8;&#x5BC6;&#x9375;&#x3068;&#x516C;&#x958B;&#x9375;&#x3092;&#x4E21;&#x65B9;&#x540C;&#x6642;&#x306B;&#x751F;&#x6210;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="h">-h</dt>
<dd>

<p>&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x4EE5;&#x964D;&#x306E;&#x5F15;&#x6570;&#x3092;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3068;&#x307F;&#x306A;&#x3059;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;&#x305D;&#x308C;&#x305E;&#x308C;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;8192&#x30D0;&#x30A4;&#x30C8;&#x306E;&#x304B;&#x305F;&#x307E;&#x308A;&#x3068;&#x3057;&#x3066;&#x8AAD;&#x307F;&#x3053;&#x307E;&#x308C;&#x3001; SHA&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x304C;&#x8A08;&#x7B97;&#x3055;&#x308C;&#x308B;&#x3002; &#x5F15;&#x6570;&#x304C;&#x306A;&#x3044;&#x5834;&#x5408;&#x3084;&#x5F15;&#x6570;&#x304C;&quot;<code>-</code>&quot;&#x3067;&#x3042;&#x3063;&#x305F;&#x5834;&#x5408;&#x306F;&#x6A19;&#x6E96;&#x5165;&#x529B;&#x306E;&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x304C;&#x8A08;&#x7B97;&#x3055;&#x308C;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> $ zebedee -h /etc/passwd
 bb1e734aeffd2111417761f5938dea3b53759598 /etc/passwd
 $ zebedee -h &lt; /etc/passwd
 bb1e734aeffd2111417761f5938dea3b53759598 -</code></pre>

<p>&#x306E;&#x69D8;&#x306A;&#x5F62;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="H">-H</dt>
<dd>

<p>&#x3053;&#x3061;&#x3089;&#x306F;<b>-h</b>&#x3068;&#x4F3C;&#x3066;&#x3044;&#x308B;&#x304C;&#x3001;&#x5F15;&#x6570;&#x304C;&#x6587;&#x5B57;&#x5217;&#x3068;&#x3057;&#x3066;&#x6271;&#x308F;&#x308C;&#x3001; &#x305D;&#x306E;&#x6587;&#x5B57;&#x5217;&#x306E;SHA&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x304C;&#x8A08;&#x7B97;&#x3055;&#x308C;&#x8868;&#x793A;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<pre><code> $ zebedee -H hello world
 ac62a630ca850b4ea07eda664eaecf9480843152 hello
 86bf25ecb8a40b40b885c097c683b6e236fc8085 world</code></pre>

</dd>
<dt id="S-Windows-only">-S (Windows only)</dt>
<dd>

<p>Windows&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F; <b>Zebedee</b> &#x3092; &#x30B5;&#x30FC;&#x30D3;&#x30B9;(&#x30D6;&#x30FC;&#x30C8;&#x6642;&#x306B;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x8D77;&#x52D5;&#x3055;&#x308C;&#x72EC;&#x7ACB;&#x3057;&#x3066;&#x52D5;&#x304F;&#x30D7;&#x30ED;&#x30BB;&#x30B9;)&#x3068;&#x3057;&#x3066; &#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<p><b>Zebedee</b>&#x306F;<b>install</b>&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3068;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067; &#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3068;&#x3057;&#x3066;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x308B;&#x3002;&#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> zebedee -Sinstall=c:\zebedee\service.zbd</code></pre>

<p>&#x306E;&#x69D8;&#x306A;&#x5F62;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x5E38;&#x306B;&#x3001;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D5;&#x30EB;&#x30D1;&#x30B9;&#x3092;&#x6307;&#x5B9A;&#x3057;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002; &#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;&#x30B9;&#x30BF;&#x30FC;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x6642;&#x306B;&#x8AAD;&#x307F;&#x3053;&#x307E;&#x308C;&#x3001; &#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x304C;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x5FC5;&#x8981;&#x306A;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3092;&#x5168;&#x3066;&#x542B;&#x3093;&#x3067;&#x3044;&#x306A;&#x3051;&#x308C;&#x3070;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

<p>&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001; &#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x308B;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x540D;&#x524D;&#x306F;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x540D;&#x524D;&#x304B;&#x3089;&#x53D6;&#x3089;&#x308C;&#x308B;&#x3002; &#x5F93;&#x3063;&#x3066;&#x901A;&#x5E38;&#x306F;<b>Zebedee</b>&#x306B;&#x306A;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;<b>-n</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x5909;&#x66F4;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee -n &quot;Zebedee Client Service&quot; -Sinstall=c:\zebedee\clientsvc.zbd</code></pre>

<p>&#x4E00;&#x65E6;&#x3001;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x304C;&#x30A4;&#x30F3;&#x30B9;&#x30C8;&#x30FC;&#x30EB;&#x3055;&#x308C;&#x308B;&#x3068;&#x3001;&#x6B21;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x518D;&#x8D77;&#x52D5;&#x304B;&#x3089;&#x81EA;&#x52D5;&#x7684;&#x306B;&#x8D77;&#x52D5;&#x3055;&#x308C;&#x308B;&#x3002; &#x3082;&#x3057;&#x304F;&#x306F;(Windows NT&#x306E;&#x5834;&#x5408;)&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30D1;&#x30CD;&#x30EB;&#x3067;&#x624B;&#x52D5;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<p>&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x524A;&#x9664;&#x3059;&#x308B;&#x306B;&#x306F;&#x307E;&#x305A;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x3092;&#x7D42;&#x4E86;&#x3057;&#x3066;&#x304B;&#x3089;&#x3001;<b>-S</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3068; <b>remove</b> &#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3092;&#x4F7F;&#x3046;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;&#x3082;&#x3057;&#x5FC5;&#x8981;&#x306A;&#x3089;&#x3070;<b>-n</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3067;&#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x306E;&#x540D;&#x79F0;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> zebedee -n &quot;Zebedee Client Service&quot; -Sremove</code></pre>

<p>&#x306E;&#x69D8;&#x306A;&#x5F62;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p><b>-S</b>&#x306E;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x306F;&#x4ED6;&#x306B; <b>run</b> &#x304C;&#x3042;&#x308B;&#x3002;&#x3053;&#x308C;&#x306F;&#x5185;&#x90E8;&#x3067; <b>Zebedee</b> &#x306E; &#x30B5;&#x30FC;&#x30D3;&#x30B9;&#x30B9;&#x30BF;&#x30FC;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x30B3;&#x30FC;&#x30C9;&#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x4F7F;&#x3046;&#x3082;&#x306E;&#x3067;&#x3001; &#x30E6;&#x30FC;&#x30B6;&#x304C;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x3057;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="x">-x</dt>
<dd>

<p>&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x3044;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D1;&#x30E9;&#x30E1;&#x30FC;&#x30BF;&#x3092; &#x6307;&#x5B9A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;&#x3053;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x3053;&#x308C;&#x306B;&#x6587;&#x5B57;&#x5217;&#x306E;&#x5F15;&#x6570;&#x3092;&#x3064;&#x3051;&#x308B;&#x3068;&#x3001; &#x305D;&#x308C;&#x304C;&#x3042;&#x305F;&#x304B;&#x3082;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;1&#x884C;&#x3067;&#x3042;&#x308B;&#x304B;&#x306E;&#x3088;&#x3046;&#x306B;&#x51E6;&#x7406;&#x3055;&#x308C;&#x308B;&#x3002; &#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306F;&#x8A8D;&#x8B58;&#x3055;&#x308C;&#x308B;&#x304C;&#x3001;&quot;\&quot;&#x306E;&#x7D99;&#x7D9A;&#x884C;&#x306F;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x306A;&#x3044;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;</p>
</P>

<pre><code> zebedee -x &quot; server true # It&#39;s a server!&quot;</code></pre>

<p>&#x3068;&#x3044;&#x3046;&#x307E;&#x308F;&#x308A;&#x304F;&#x3069;&#x3044;&#x3084;&#x308A;&#x304B;&#x305F;&#x3067;&#x3082;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;</p>
</P>

<pre><code> zebedee -s</code></pre>

<p>&#x3068;&#x540C;&#x3058;&#x52B9;&#x679C;&#x3092;&#x5F97;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

</dd>
</dl>

<h2 id="Identity-Checking">Identity Checking</h2>

<p><b>Zebedee</b> &#x306F;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;2&#x70B9;&#x9593;&#x306B;&#x6697;&#x53F7;&#x5316;&#x30C1;&#x30E3;&#x30CD;&#x30EB;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x306B;&#x904E;&#x304E;&#x306A;&#x3044;&#x3002; &#x3054;&#x627F;&#x77E5;&#x306E;&#x901A;&#x308A;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x306F; &quot;on the wire (&#x901A;&#x4FE1;&#x7DDA;&#x4E0A;)&quot; &#x3067;&#x306E;&#x76D7;&#x8074;&#x304B;&#x3089;&#x306F;&#x5B88;&#x3089;&#x308C;&#x308B;&#x304C;&#x3001; &#x3042;&#x306A;&#x305F;&#x304C;&#x60F3;&#x5B9A;&#x3057;&#x3066;&#x3044;&#x308B;&#x76F8;&#x624B;&#x306B;&#x63A5;&#x7D9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x304B;&#x5426;&#x304B;&#x306F;&#x4FDD;&#x8A3C;&#x3055;&#x308C;&#x306A;&#x3044;&#x3002; &#x3053;&#x308C;&#x306F;&#x3001;&quot;man-in-the-middle (&#x7B2C;&#x4E09;&#x8005;&#x306B;&#x3088;&#x308B;&#x6A2A;&#x53D6;&#x308A;)&quot; &#x30A2;&#x30BF;&#x30C3;&#x30AF;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x306F;&#x7121;&#x9632;&#x5099;&#x3067;&#x3042;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x304C;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x5727;&#x7E2E;&#x3068;&#x3001;&#x76D7;&#x8074;&#x304B;&#x3089;&#x5B88;&#x308B;&#x3053;&#x3068;&#x3092;&#x7B2C;&#x4E00;&#x306B;&#x5FC3;&#x914D;&#x3057;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001; &#x3042;&#x306A;&#x305F;&#x306F;&#x3053;&#x306E;&#x6761;&#x4EF6;&#x306B;&#x6E80;&#x8DB3;&#x3059;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x306E;&#x901A;&#x4FE1;&#x304C;&#x7B2C;&#x4E09;&#x8005;&#x306B;&#x6A2A;&#x53D6;&#x308A;&#x3055;&#x308C;&#x3066;&#x3044;&#x306A;&#x3044;&#x3053;&#x3068;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x4FDD;&#x8A3C;&#x3092;&#x6C42;&#x3081;&#x308B;&#x306A;&#x3089;&#x3001; <b>Zebedee</b> &#x306F;&#x305D;&#x308C;&#x3092;&#x884C;&#x3046;&#x305F;&#x3081;&#x306E;&#x4FBF;&#x5B9C;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x3082;&#x3057;&#x3001;&#x540C;&#x4E00;&#x306E;&#x7D20;&#x6570;&#x3068;&#x539F;&#x59CB;&#x6839;&#x3068;&#x79D8;&#x5BC6;&#x9375;&#x304C;&#x7528;&#x3044;&#x3089;&#x308C;&#x308B;&#x306A;&#x3089;&#x3001;&#x305D;&#x308C;&#x3089;&#x306F; Diffie-Hellman &#x306E;&#x9375;&#x4EA4;&#x63DB;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306E;&#x305F;&#x3081;&#x306B;&#x3001;&#x5E38;&#x306B;&#x540C;&#x3058;&#x516C;&#x958B;&#x9375;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; &#x3082;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x304C;(&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;<b><a href="#item_privatekey">privatekey</a></b>&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x306B;&#x3066;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x305F;) &#x56FA;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x79D8;&#x5BC6;&#x9375;&#x3092;&#x7528;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001; <b>Zebedee</b> &#x306F;&#x7D20;&#x6570;&#x3068;&#x539F;&#x59CB;&#x6839;&#x3068;&#x79D8;&#x5BC6;&#x9375;&#x306E;&#x5024;&#x306E;&#x5168;&#x3066;&#x3092;&#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x3057;&#x3066; &quot;fingerprint (&#x6307;&#x7D0B;)&quot; &#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x3001;<b>-P</b> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x3088;&#x308A;&#x884C;&#x308F;&#x308C;&#x308B;&#x3002; &#x4F8B;&#x3048;&#x3070;&#x3001;server.key &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x6B21;&#x306E;&#x5024;</p>
</P>

<pre><code> privatekey &quot;1e34d6769502bae1087c18d2e8c8776e4a17ddaf&quot;</code></pre>

<p>&#x3067;&#x3042;&#x308B;&#x3068;&#x304D;&#x3001;</p>
</P>

<p>&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;</p>
</P>

<pre><code> $ zebedee -P -f server.key &gt; server.id</code></pre>

<p>&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3068;&#x3001;</p>
</P>

<p>&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x51FA;&#x529B;</p>
</P>

<pre><code> 135f04050961d37553731250d5c6f7495f088b32 myhostname</code></pre>

<p>&#x304C;&#x5F97;&#x3089;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x6700;&#x521D;&#x306E;16&#x9032;&#x6570;&#x304C; &quot;fingerprint (&#x6307;&#x7D0B;)&quot; &#x3067;&#x3042;&#x308B;&#x3002; &#x884C;&#x4E2D;&#x306E;&#x4ED6;&#x306E;&#x6587;&#x5B57;&#x5217;&#x306F;&#x3001;&#x3053;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x306E;&#x6240;&#x6709;&#x8005;&#x3092;&#x8868;&#x3059;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x3067;&#x3042;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;&#x3053;&#x308C;&#x306F;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x305F;&#x30DE;&#x30B7;&#x30F3;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x304A;&#x3044;&#x3066; <b><a href="#item_checkidfile">checkidfile</a></b> &#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x305F;&#x5834;&#x5408;&#x3001;&#x305D;&#x306E;&#x5024;&#x306F; &quot;fingerprint (&#x6307;&#x7D0B;)&quot; &#x884C;&#x3092;&#x8A18;&#x8FF0;&#x3057;&#x305F;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x540D;&#x3067;&#x3042;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;&#x63A5;&#x7D9A; &#x5148;&#x306E;&#x30A2;&#x30A4;&#x30C7;&#x30F3;&#x30C6;&#x30A3;&#x30C6;&#x30A3;&#x304C;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x4E2D;&#x306E;&#x3044;&#x304B;&#x306A;&#x308B;&#x5024;&#x3068;&#x3082;&#x4E00;&#x81F4;&#x3057;&#x306A;&#x3044;&#x5834;&#x5408;&#x3001; &#x63A5;&#x7D9A;&#x306F;&#x5207;&#x65AD;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<h2 id="Notes-on-Other-Security-Issues">&#x305D;&#x306E;&#x4ED6;&#x306E;&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x95A2;&#x9023;&#x306E;&#x6CE8;&#x8A18;(Notes on Other Security Issues)</h2>

<dl>

<dt id="Message-Integrity">Message Integrity</dt>
<dd>

<p>&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306E;&#x30AA;&#x30FC;&#x30D0;&#x30FC;&#x30D8;&#x30C3;&#x30C9;&#x3092;&#x53EF;&#x80FD;&#x306A;&#x9650;&#x308A;&#x5C0F;&#x3055;&#x304F;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001; <b>Zebedee</b> &#x306F;&#x4F1D;&#x9001;&#x3055;&#x308C;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x306E;&#x6B63;&#x3057;&#x3055;&#x306B;&#x5BFE;&#x3059;&#x308B;&#x78BA;&#x8A8D;&#x306F;&#x4F55;&#x3082;&#x884C;&#x3063;&#x3066;&#x3044;&#x306A;&#x3044;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x30A2;&#x30BF;&#x30C3;&#x30AB;&#x30FC;&#x306F;&#x9014;&#x4E2D;&#x3067;&#x30C7;&#x30FC;&#x30BF;&#x30D1;&#x30B1;&#x30C3;&#x30C8;&#x3092;&#x6539;&#x5909;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x6697;&#x53F7;&#x306E;&#x4F7F;&#x7528;&#x306F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x4EFB;&#x610F;&#x306B;&#x5909;&#x63DB;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x6975;&#x3081;&#x3066;&#x56F0;&#x96E3;&#x306B;&#x3057;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x306F;&#x306A;&#x3044;&#x304B; (&#x4F8B;&#x3048;&#x3070;&#x3001;&quot;<code>ls -l</code>&quot;&#x3092;&quot;<code>rm -f</code>&quot;&#x306B;&#x66F8;&#x304D;&#x63DB;&#x3048;&#x3089;&#x308C;&#x308B;&#x304B;&#x3044;&#xFF1F;) &#x3002; &#x3057;&#x304B;&#x3057;&#x3001;<b>Zebedee</b> &#x306F;&#x30E9;&#x30F3;&#x30C0;&#x30E0;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x304C;&#x9001;&#x3089;&#x308C;&#x305F;&#x3053;&#x3068;&#x306B;&#x3088;&#x308B;&#x5F71;&#x97FF;&#x304B;&#x3089; &#x30A2;&#x30D7;&#x30EA;&#x30B1;&#x30FC;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5B88;&#x308B;&#x3053;&#x3068;&#x306F;&#x884C;&#x308F;&#x306A;&#x3044;&#x3002;</p>
</P>

</dd>
<dt id="Replay-and-Insertion-Attacks">Replay and Insertion Attacks</dt>
<dd>

<p>&#x591A;&#x304F;&#x306E;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306B;&#x304A;&#x3044;&#x3066;&#x6709;&#x308A;&#x5F97;&#x308B;&#x653B;&#x6483;&#x306E;&#x4E00;&#x3064;&#x306F; &#x30C7;&#x30FC;&#x30BF;&#x306E;&#x30AD;&#x30E3;&#x30D7;&#x30C1;&#x30E3;&#x30EA;&#x30F3;&#x30B0;&#x3067;&#x3042;&#x308A;&#x3001;&#x826F;&#x304F;&#x77E5;&#x3089;&#x308C;&#x305F;&#x52B9;&#x679C;&#x3092;&#x53CA;&#x307C;&#x3059; (&#x4F8B;&#x3048;&#x3070;&#x3001;&#x7BA1;&#x7406;&#x8005;&#x306E; <b>telnet</b> &#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x306F;&#x3042;&#x308B;&#x7A2E;&#x306E;&quot;&#x5371;&#x967A;&#x306A;&quot;&#x64CD;&#x4F5C;&#x304C;&#x4F34;&#x3044;&#x3001; &#x305D;&#x306E;&#x64CD;&#x4F5C;&#x3092;&#x5F8C;&#x306B;&#x7E70;&#x308A;&#x8FD4;&#x3055;&#x308C;&#x305F;&#x3089;&#x3069;&#x3046;&#x306A;&#x308B;&#x304B;)&#x3002; &#x3053;&#x308C;&#x3092;&#x884C;&#x3046;&#x306B;&#x306F;&#x3001;&#x6697;&#x53F7;&#x5316;&#x3055;&#x308C;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x30E0;&#x3092;&#x6539;&#x5909;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x7121;&#x3044;&#x304C;&#x3001; &#x30B5;&#x30FC;&#x30D0;&#x306B;&#x9001;&#x3089;&#x308C;&#x305F;&#x540C;&#x3058;&#x30CD;&#x30C3;&#x30C8;&#x30EF;&#x30FC;&#x30AF;&#x30D1;&#x30B1;&#x30C3;&#x30C8;&#x306F;&#x3001;&#x540C;&#x3058;&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x3092;&#x5F15;&#x304D;&#x51FA;&#x3059;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

<p><b>Zebedee</b> &#x304C; &quot;anonymous&quot; &#x30E2;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x304D;&#x3001; &#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x6BCE;&#x306B;&#x7570;&#x306A;&#x308B;&#x9375;&#x304C;&#x751F;&#x6210;&#x3055;&#x308C;&#x308B;&#x305F;&#x3081;&#x3001; &#x3053;&#x306E;&#x3088;&#x3046;&#x306A;&#x30A2;&#x30BF;&#x30C3;&#x30AF;&#x304C;&#x6210;&#x529F;&#x3059;&#x308B;&#x5371;&#x967A;&#x306F;&#x975E;&#x5E38;&#x306B;&#x5C0F;&#x3055;&#x3044;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;<a>identity checking</a>&#x306E;&#x6A5F;&#x80FD;&#x304C;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x308B;&#x3068;&#x304D;&#x306B;&#x306F; &#x9375;&#x306F;&#x56FA;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001;&#x518D;&#x751F;&#x306F;&#x5B9F;&#x969B;&#x306B;&#x53EF;&#x80FD;&#x6027;&#x304C;&#x3042;&#x308B;&#x3002; <b>Zebedee</b>&#x306F;&#x3001;&#x4E00;&#x3064;&#x4E00;&#x3064;&#x306E;&#x63A5;&#x7D9A;&#x6BCE;&#x306B;&#x30E6;&#x30CB;&#x30FC;&#x30AF;&#x306A;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x30AD;&#x30FC;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x3053;&#x306E;&#x554F;&#x984C;&#x306B;&#x5BFE;&#x51E6;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002; &#x3053;&#x306E;&#x65B9;&#x6CD5;&#x3067;&#x306F;&#x3001;&#x63A5;&#x7D9A;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x306E;&#x6700;&#x5F8C;&#x306B;&#x3001;&#x30C1;&#x30E3;&#x30EC;&#x30F3;&#x30B8;-&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x306E;&#x4EA4;&#x63DB;&#x304C;&#x884C;&#x306A;&#x308F;&#x308C;&#x3001; &#x76F8;&#x624B;&#x5074;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x304C;shared secret key&#x3092;&#x4FDD;&#x6301;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001; &#x4EE5;&#x524D;&#x306B;&#x8A18;&#x9332;&#x3055;&#x308C;&#x305F;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x30AA;&#x30A6;&#x30E0;&#x8FD4;&#x3057;&#x3057;&#x3066;&#x3044;&#x308B;&#x308F;&#x3051;&#x3067;&#x306F;&#x306A;&#x3044;&#x3053;&#x3068;&#x304C;&#x3001; &#x78BA;&#x8A8D;&#x3055;&#x308C;&#x308B;&#x3002;</p>
</P>

<p>&#x52A0;&#x3048;&#x3066;&#x3001;<b>Zebedee</b> &#x306F; Blowfish &#x6697;&#x53F7;&#x6CD5;&#x3092; &quot;cipher feedback&quot; &#x30E2;&#x30FC;&#x30C9;&#x3067;&#x7528;&#x3044;&#x3066;&#x304A;&#x308A;&#x3001; &#x30C7;&#x30FC;&#x30BF;&#x306E;&#x3042;&#x3089;&#x3086;&#x308B;&#x90E8;&#x5206;&#x306E;&#x8907;&#x53F7;&#x306F;&#x3001; &#x305D;&#x308C;&#x4EE5;&#x524D;&#x306E;&#x5168;&#x3066;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30D1;&#x30B1;&#x30C3;&#x30C8;&#x306E;&#x8907;&#x53F7;&#x304C;&#x6210;&#x529F;&#x3057;&#x3066;&#x3044;&#x308B;&#x304B;&#x3069;&#x3046;&#x304B;&#x306B;&#x4F9D;&#x5B58;&#x3059;&#x308B;&#x3002; &#x30C1;&#x30E3;&#x30EC;&#x30F3;&#x30B8;&#x30FB;&#x30EC;&#x30B9;&#x30DD;&#x30F3;&#x30B9;&#x306F;&#x30C7;&#x30FC;&#x30BF;&#x30B9;&#x30C8;&#x30EA;&#x30FC;&#x30E0;&#x306E; &quot;salts&quot; &#x3092;&#x4EA4;&#x63DB;&#x3059;&#x308B;&#x306E;&#x3067;&#x3001; &#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x5316;&#x3055;&#x308C;&#x305F;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306B; &quot;known plain-text&quot; &#x30A2;&#x30BF;&#x30C3;&#x30AF;(&#x8F9E;&#x66F8;&#x653B;&#x6483;)&#x3092;&#x52A0;&#x3048;&#x308B;&#x306E;&#x306F; &#x3088;&#x308A;&#x56F0;&#x96E3;&#x306B;&#x306A;&#x308B;&#x3002;</p>
</P>

</dd>
<dt id="Key-Generation">Key Generation</dt>
<dd>

<p>&#x826F;&#x304F;&#x306A;&#x3044;&#x9375;&#x306E;&#x4F7F;&#x7528;&#x306F;&#x3001;&#x6700;&#x5F37;&#x306E;&#x6697;&#x53F7;&#x5316;&#x30E1;&#x30AB;&#x30CB;&#x30BA;&#x30E0;&#x3092;&#x3082;&#x6C5A;&#x3059;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x9375;&#x3092;&#x751F;&#x6210;&#x3059;&#x308B;&#x3068;&#x304D;&#x3001;<b>Zebedee</b> &#x306F;&#x53EF;&#x80FD;&#x306A;&#x9650;&#x308A;&#x63A8;&#x6E2C;&#x304C;&#x56F0;&#x96E3;&#x306A;&#x30C7;&#x30FC;&#x30BF;&#x3092;&#x304B;&#x304D;&#x96C6;&#x3081;&#x3066;&#x3001; &#x305D;&#x308C;&#x3092; SHA &#x30CF;&#x30C3;&#x30B7;&#x30E5;&#x30A2;&#x30EB;&#x30B4;&#x30EA;&#x30BA;&#x30E0;&#x306B;&#x3088;&#x308A; &quot;&#x30B9;&#x30C6;&#x30A2; (&#x304B;&#x304D;&#x6DF7;&#x305C;&#x308B;)&quot; &#x3059;&#x308B;&#x3002;</p>
</P>

<p>Windows&#x306E;&#x5834;&#x5408;&#x3001;&#x30A2;&#x30BF;&#x30C3;&#x30AB;&#x30FC;&#x304C;&#x65E2;&#x306B;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3057;&#x3066;&#x3044;&#x308C;&#x3070;&#x3001; &#x53D6;&#x5F97;&#x53EF;&#x80FD;&#x306A;&#x3042;&#x3089;&#x3086;&#x308B;&#x30C7;&#x30FC;&#x30BF;&#x306F;&#x4E88;&#x6E2C;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x65E2;&#x306B;&#x8A00;&#x53CA;&#x3057;&#x305F;&#x3088;&#x3046;&#x306B;&#x3001; &#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x7528;&#x9014;&#x306B;&#x304A;&#x3044;&#x3066;&#x3053;&#x308C;&#x306F;&#x8A31;&#x5BB9;&#x3067;&#x304D;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002; &#x8208;&#x5473;&#x304C;&#x3042;&#x308B;&#x306A;&#x3089;&#x3070;&#x3001;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x4E2D;&#x306E;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x306B;&#x8A73;&#x7D30;&#x304C;&#x8AAC;&#x660E;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x306E;&#x3067;&#x3001; &#x53C2;&#x7167;&#x3055;&#x308C;&#x305F;&#x3044;&#x3002;</p>
</P>

<p>&#x3082;&#x3057;&#x3001;&#x9375;&#x306E;&#x751F;&#x6210;&#x30E1;&#x30AB;&#x30CB;&#x30BA;&#x30E0;&#x306B;&#x4E0D;&#x6E80;&#x304C;&#x3042;&#x308B;&#x306A;&#x3089;&#x3001; &#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x4E2D;&#x306E;<b><a href="#item_keygencommand">keygencommand</a></b> &#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x7528;&#x3044;&#x3066;&#x3001; &#x5916;&#x90E8;&#x306E;&#x9375;&#x751F;&#x6210;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x3092;&#x547C;&#x3079;&#x3070;&#x826F;&#x3044;&#x3002; &#x7D44;&#x307F;&#x8FBC;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x6027;&#x80FD;&#x3092;&#x6539;&#x5584;&#x3059;&#x308B;&#x63D0;&#x6848;&#x306F;&#x5927;&#x6B53;&#x8FCE;&#x3060;!</p>
</P>

</dd>
</dl>

<h1 id="TROUBLESHOOTING">&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x30B7;&#x30E5;&#x30FC;&#x30C6;&#x30A3;&#x30F3;&#x30B0;(TROUBLESHOOTING)</h1>

<p><b>Zebedee</b> &#x306F;&#x300C;&#x7BB1;&#x304B;&#x3089;&#x51FA;&#x3057;&#x3066;&#x3059;&#x3050;&#x305D;&#x306E;&#x307E;&#x307E;&#x300D;&#x52D5;&#x304F;&#x3079;&#x304D;&#x3060;&#x304C;&#x3001;&#x3042;&#x306A;&#x305F;&#x306F;&#x30C8;&#x30E9;&#x30D6;&#x30EB; &#x306B;&#x3042;&#x3046;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30C8;&#x30E9;&#x30D6;&#x30EB;&#x306F;&#x63A5;&#x7D9A;&#x306E;&#x78BA;&#x7ACB;&#x6642;&#x306B;&#x8D77;&#x3053;&#x308B; (&#x63A5;&#x7D9A;&#x3055;&#x3048;&#x3046;&#x307E;&#x304F;&#x3044;&#x3051;&#x3070;&#x3001;&#x30C7;&#x30FC;&#x30BF;&#x8EE2;&#x9001;&#x306F;&#x30B9;&#x30E0;&#x30FC;&#x30BA;&#x306B;&#x3044;&#x304F;&#x3053;&#x3068;&#x304C;&#x591A;&#x3044;)&#x3002; (&#x63A5;&#x7D9A;&#x306E;)&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x306E;&#x624B;&#x9806;&#x306B;&#x4F55;&#x304C;&#x8D77;&#x3053;&#x3063;&#x3066;&#x3044;&#x308B;&#x304B;&#x7C21;&#x5358;&#x306B;&#x898B;&#x308B;&#x306B;&#x306F;<b>-v</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092; &#x4F7F;&#x3048;&#x3070;&#x3088;&#x3044;&#x3002;<b>-d</b> <b>-D</b> &#x3082;&#x3044;&#x3063;&#x3057;&#x3087;&#x306B;&#x4F7F;&#x3063;&#x3066;&#x3001;<b>Zebedee</b>&#x3092;&#x7AEF;&#x672B;&#x304B;&#x3089;&#x7D42;&#x4E86;&#x3067;&#x304D; &#x308B;&#x3088;&#x3046;&#x306B;&#x3057;&#x3066;&#x3001;&#x4E00;&#x5EA6;&#x306B;&#x4E00;&#x3064;&#x306E;&#x63A5;&#x7D9A;&#x3057;&#x304B;&#x51E6;&#x7406;&#x3057;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x3057;&#x305F;&#x307B;&#x3046;&#x304C;&#x3044; &#x3044;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;&#x3060;&#x304B;&#x3089;&#x3001;&#x3053;&#x3093;&#x306A;&#x611F;&#x3058;&#x306B;&#x306A;&#x308B;&#x3060;&#x308D;&#x3046;&#x3002;</p>
</P>

<pre><code> zebedee -dD -v 3 -s</code></pre>

<p>&#x30ED;&#x30AE;&#x30F3;&#x30B0;&#x30EC;&#x30D9;&#x30EB;&#x3092;3&#x306B;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x63A5;&#x7D9A;&#x306E;&#x30BB;&#x30C3;&#x30C8;&#x30A2;&#x30C3;&#x30D7;&#x306E;&#x4E3B;&#x306A;&#x3084;&#x308A;&#x3068;&#x308A;&#x3092;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x554F;&#x984C;&#x304C;&#x305D;&#x306E;&#x5F8C;&#x306B;&#x8D77;&#x304D;&#x3066;&#x308B;&#x3068;&#x78BA;&#x4FE1;&#x304C;&#x6301;&#x3066;&#x308B;&#x306A;&#x3089;&#x3070;&#x3001; &#x30EC;&#x30D9;&#x30EB;&#x3092;4&#x304B;5&#x306B;&#x3059;&#x308C;&#x3070;&#x3001; (&#x63A5;&#x7D9A;&#x6642;&#x3060;&#x3051;&#x3067;&#x306A;&#x304F;)&#x5B9F;&#x969B;&#x306E;&#x901A;&#x4FE1;&#x3067;&#x4F55;&#x304C;&#x3084;&#x308A;&#x3068;&#x308A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308B;&#x304B;&#x3082;&#x898B;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<h1 id="EXAMPLES">EXAMPLES</h1>

<p><b>Zebedee</b> &#x306E;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x306F;&#x3001;&#x305F;&#x304F;&#x3055;&#x3093;&#x306E;&#x30B5;&#x30F3;&#x30D7;&#x30EB;&#x306E;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002; &#x3053;&#x3053;&#x3067;&#x306F;&#x3001;&#x305D;&#x308C;&#x3089;&#x306E;&#x4F7F;&#x7528;&#x6CD5;&#x3068; <b>Zebedee</b> &#x3092; &#x7279;&#x5B9A;&#x306E;&#x3044;&#x304F;&#x3064;&#x304B;&#x306E;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x5177;&#x4F53;&#x7684;&#x306A;&#x65B9;&#x6CD5;&#x3092;&#x8FF0;&#x3079;&#x308B;&#x3002;</p>
</P>

<h2 id="Example-Server-Configuration">&#x30B5;&#x30FC;&#x30D0;&#x8A2D;&#x5B9A;&#x306E;&#x4F8B;(Example Server Configuration)</h2>

<p><b>Zebedee</b>&#x306E;&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B; <i>server.zbd</i> &#x3068;&#x3044;&#x3046;&#x8A2D;&#x5B9A;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x304C;&#x3042;&#x308B;&#x3002; &#x3053;&#x308C;&#x306B;&#x306F;&#x3088;&#x304F;&#x4F7F;&#x308F;&#x308C;&#x308B;&#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x8A2D;&#x5B9A;&#x4F8B;&#x304C;&#x3042;&#x308B;&#x3002;</p>
</P>

<pre><code> #
 # Sample Zebedee server configuration file
 #
 # This shows the use of many, but not all, of the configuration file
 # options available for use by a server.
 #
 
 verbosity 2            # Slightly more than basic messages
 
 server true            # Yes, it&#39;s a server!
 detached true          # Run detached from terminal
 udpmode false          # Are we operating in UDP mode?
 
 # Uncomment the following line to log messages to a file
 #
 #  logfile &#39;./server.log&#39;
 #
 # Or to log to the system logging facility uncomment this:
 #
 #  logfile SYSLOG
 
 # Uncomment the following line if you want to use a fixed private
 # key stored in a static file. The file should contain a line of
 # the form &quot;privatekey hexadecimal-key-string&quot;
 #
 #  include &#39;./server.key&#39;
 
 keygenlevel 2          # Generate maximum strength private keys
 
 # To validate the identity of clients uncomment the following
 # line:
 #
 #  checkidfile &#39;./clients.id&#39;
 
 # Set up allowed redirection ports.
 # These should be pretty safe -- but it&#39;s not a good idea
 # to open up all ports.
 
 redirect &quot;telnet ftp&quot;          # Basic services
 redirect 5900-5999             # VNC traffic
 redirect 6000-6010             # X Window System
 redirect &quot;daytime chargen&quot;     # Ports useful for testing
 
 targethost localhost           # Redirection is to the local machine
 
 compression zlib:9             # Allow maximum zlib compression
 keylength 256                  # Allow keys up to 256 bits
 keylifetime 36000              # Shared keys last 10 hours
 maxbufsize 16383               # Allow maximum possible buffer size</code></pre>

<p>&#x8A8D;&#x8A3C;&#x306E;&#x6A5F;&#x80FD;&#x3092;&#x30C6;&#x30B9;&#x30C8;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F;&#x3001; <b><a href="#item_checkidfile">checkidfile</a></b>&#x306E;&#x884C;&#x3092;&#x30B3;&#x30E1;&#x30F3;&#x30C8;&#x30A2;&#x30A6;&#x30C8;&#x3057;&#x3001; &#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B;<i>client1.key</i>&#x304B;<i>client2.key</i>&#x3068;&#x3044;&#x3046;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x5074;&#x3067;&#x4F7F;&#x7528;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;</p>
</P>

<h2 id="VNC-Use-with-VNC">VNC&#x306E;&#x4F7F;&#x7528;&#x4F8B;(Use with VNC)</h2>

<p><b>Zebedee</b>&#x3092;&#x4F5C;&#x3063;&#x305F;&#x7406;&#x7531;&#x306E;&#x4E00;&#x3064;&#x3068;&#x3057;&#x3066;&#x3001;&#x30C0;&#x30A4;&#x30A2;&#x30EB;&#x30A2;&#x30C3;&#x30D7;&#x3067;VNC&#x3092;&#x4F7F;&#x3046;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x3002; VNC&#x306F;&#x300C;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30D5;&#x30EC;&#x30FC;&#x30E0;&#x30D0;&#x30C3;&#x30D5;&#x30A1;&#x30B3;&#x30F3;&#x30BB;&#x30D7;&#x30C8;&#x300D;&#x3092;&#x4F7F;&#x3044;&#x3001; &#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x30C7;&#x30A3;&#x30B9;&#x30D7;&#x30EC;&#x30A4;&#x3092;&#x63D0;&#x4F9B;&#x3059;&#x308B;&#x30D5;&#x30EA;&#x30FC;&#x306E;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x3042;&#x308B;&#x3002; Windows&#x306E;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x3092;&#x96E2;&#x308C;&#x305F;&#x6240;&#x306B;&#x8868;&#x793A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3057;&#x3001; &quot;Xvnc&quot;&#x30B5;&#x30FC;&#x30D0;&#x3092;&#x4F7F;&#x3063;&#x3066; X &#x306E;&#x30C7;&#x30B9;&#x30AF;&#x30C8;&#x30C3;&#x30D7;&#x3092; VNC&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30DE;&#x30B7;&#x30F3;&#x304B;&#x3089;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3057;&#x3001; Java&#x3092;&#x4F7F;&#x3048;&#x308B;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x30FC;&#x306E;&#x4E2D;&#x304B;&#x3089;&#x64CD;&#x4F5C;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x8A73;&#x3057;&#x304F;&#x306F;http://www.uk.research.att.com/vnc/&#x3092;&#x53C2;&#x7167;&#x306E;&#x3053;&#x3068;&#x3002;</p>
</P>

<p>&#x63D0;&#x4F9B;&#x3055;&#x308C;&#x308B;&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x8A2D;&#x5B9A;&#x4F8B;&#x3067;&#x3042;&#x308B;<i>server.zbd</i> &#x306F; 5900-5999 &#x30DD;&#x30FC;&#x30C8;&#x3092; &#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3057;&#x3066;VNC&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x30C8;&#x30F3;&#x30CD;&#x30EA;&#x30F3;&#x30B0;&#x3059;&#x308B;&#x3002; &#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306F;UNIX&#x3067;&#x3082;Windows&#x3067;&#x3082;&#x4F7F;&#x7528;&#x3067;&#x304D;&#x308B;&#x304C;&#x3001; Windows&#x3067;&#x4F7F;&#x3046;&#x305F;&#x3081;&#x306B;&#x306F;&#x3001;&#x30EC;&#x30B8;&#x30B9;&#x30C8;&#x30EA;&#x306E;&quot;AllowLoopback&quot;&#x30D5;&#x30E9;&#x30B0;&#x3092; &#x30BB;&#x30C3;&#x30C8;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x306E;&#x3067;&#x6CE8;&#x610F;&#x3002; &#x4EE5;&#x4E0B;&#x306E;&#x65AD;&#x7247;&#x3092;(&#x5148;&#x982D;&#x306E;&#x30B9;&#x30DA;&#x30FC;&#x30B9;&#x3092;&#x53D6;&#x308A;&#x9664;&#x3044;&#x3066;&#x304B;&#x3089;)&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306B;&#x4FDD;&#x5B58;&#x3057;&#x3066; <b>regedit</b> &#x306B;&#x8AAD;&#x307E;&#x305B;&#x308C;&#x3070;&#x3001;&#x305D;&#x306E;&#x30C8;&#x30EA;&#x30C3;&#x30AF;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> REGEDIT4
 
 [HKEY_LOCAL_MACHINE\SOFTWARE\ORL\WinVNC3]
 &quot;AllowLoopback&quot;=dword:00000001
 
 [HKEY_LOCAL_MACHINE\SOFTWARE\ORL\WinVNC3\Default]</code></pre>

<p>&#x3053;&#x306E;&#x5185;&#x5BB9;&#x306F; <b>Zebedee</b> &#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306E;&#x4E2D;&#x306E; <i>vncloopback.reg</i> &#x306B;&#x3082;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002; &#x3053;&#x306E;&#x30EC;&#x30B8;&#x30B9;&#x30C8;&#x30EA;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308C;&#x3070;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x4E0E;&#x3048;&#x3089;&#x308C;&#x305F;&#x30DB;&#x30B9;&#x30C8;&#x306B;&#x30C8;&#x30F3;&#x30CD;&#x30EA;&#x30F3;&#x30B0;&#x3055;&#x308C;&#x305F;VNC &#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x3092; <i>vncviewer.zbd</i> &#x3067;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x306F;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x306E;(WinVNC&#x306E;&#x30C7;&#x30D5;&#x30A9;&#x30EB;&#x30C8;&#x3067;&#x3042;&#x308B;)5900&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x304C;&#x3001; &#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x6307;&#x5B9A;&#x3057;&#x3066;&#x4E0A;&#x66F8;&#x304D;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x4EE5;&#x4E0B;&#x306B; <i>vncviewer.zbd</i> &#x306E;&#x5185;&#x5BB9;&#x3092;&#x793A;&#x3059;&#x3002;</p>
</P>

<pre><code> #
 # Zebedee configuration file to start up a tunnelled VNC session
 #
 # Usage: zebedee -f vncviewer.zbd remote-host[:vnc-port]
 #
 
 verbosity 1         # Basic messages only
 
 server false        # It&#39;s a client
 detached true       # Detach from terminal
 
 message &quot;Starting VNC viewer on localhost:99&quot;
 
 # On Windows systems you might use the following:
 
 command &#39;&quot;c:\Program Files\ORL\VNC\vncviewer.exe&quot; localhost:99&#39;
 
 # On UNIX systems you might use the following:
 
 # command &#39;vncviewer localhost:99&#39;
 
 targetport 5900     # Remote VNC server on port 5900 unless overridden
                     # by a value specified on the command-line

 clientport 5999     # Local connection on 5999 -- i.e. localhost:99
 
 compression 6       # Request normal Zlib compression</code></pre>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B;&#x3053;&#x306E;&#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3068;&#x3001;</p>
</P>

<pre><code> zebedee -f vncviewer.zbd somehost:5901</code></pre>

<p><i>somehost</i>&#x306E;5901&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x306E;VNC&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3057;&#x305F;VNC&#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3002; &#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x306F;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DB;&#x30B9;&#x30C8;&#x306E;5999&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>VNC&#x306F;Java&#x306E;&#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x3082;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002; &#x3082;&#x3057;&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x30DD;&#x30FC;&#x30C8;59xx&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x305F;&#x3089;&#x3001; &#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x3092;58xx&#x304B;&#x3089;&#x30C0;&#x30A6;&#x30F3;&#x30ED;&#x30FC;&#x30C9;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x306A;&#x304C;&#x3089;&#x3001; &#x3069;&#x3046;&#x3082;Java&#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x306F;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3078;&#x306E;&#x30E1;&#x30A4;&#x30F3;&#x306E;VNC&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3067;&#x901A;&#x4FE1;&#x3057;&#x3066;&#x3044;&#x308B;&#x3088;&#x3046;&#x3060;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x3001;Java&#x30D3;&#x30E5;&#x30FC;&#x30EF;&#x3067;&#x3053;&#x308C;&#x3092;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001; &#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x3068;&#x30EA;&#x30E2;&#x30FC;&#x30C8;&#x3067;&#x540C;&#x3058;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x3092;&#x4F7F;&#x3046;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x4F8B;&#x3048;&#x3070;&#x3001;5901&#x756A;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x4F7F;&#x3063;&#x3066;&#x3044;&#x308B;VNC&#x30B5;&#x30FC;&#x30D0;&#x3078;&#x306E;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x3092; &#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee 5801,5901:remotehost:5801,5901</code></pre>

<p>&#x3082;&#x3057;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x3082;5901&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x4F7F;&#x3063;&#x305F;VNC&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x52D5;&#x3044;&#x3066;&#x3044;&#x308B;&#x3068;&#x3001; &#x3053;&#x308C;&#x306F;&#x3046;&#x307E;&#x304F;&#x3044;&#x304B;&#x306A;&#x3044;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x30DD;&#x30FC;&#x30C8;&#x304C;&#x885D;&#x7A81;&#x3057;&#x306A;&#x3044;&#x3088;&#x3046;&#x306B;&#x4E21;&#x8005;&#x3092;&#x8ABF;&#x6574;&#x3059;&#x308B;&#x3053;&#x3068;&#x306F;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<p>&#x3082;&#x3046;&#x3072;&#x3068;&#x3064;&#x3060;&#x3051;&#x8A00;&#x3063;&#x3066;&#x304A;&#x304F;&#x3053;&#x3068;&#x304C;&#x3042;&#x308B;&#x3002; VNC&#x3092;&#x30C7;&#x30FC;&#x30BF;&#x5727;&#x7E2E;&#x3068;&#x3068;&#x3082;&#x306B;&#x4F7F;&#x304A;&#x3046;&#x3068;&#x3057;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001; VNC&#x306E;protocol encoding&#x306B;&#x95A2;&#x3057;&#x3066;&#x5B9F;&#x9A13;&#x3057;&#x305F;&#x307B;&#x3046;&#x304C;&#x3088;&#x3044;&#x3002; &#x79C1;&#x306F;&#x3001;&quot;raw&quot; encoding &#x304C;&#x5727;&#x7E2E;&#x306E;&#x52B9;&#x679C;&#x304C;&#x9AD8;&#x304F;&#x3001; &#x9045;&#x3044;&#x56DE;&#x7DDA;&#x4E0A;&#x3067;&#x306F;&#x3088;&#x308A;&#x3088;&#x3044;&#x30D1;&#x30D5;&#x30A9;&#x30FC;&#x30DE;&#x30F3;&#x30B9;&#x3092;&#x793A;&#x3059;&#x3053;&#x3068;&#x3092;&#x767A;&#x898B;&#x3057;&#x305F;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x306E;&#x5834;&#x5408;&#x306F;&#x9055;&#x3046;&#x7D50;&#x679C;&#x3068;&#x306A;&#x308B;&#x304B;&#x3082;&#x3057;&#x308C;&#x306A;&#x3044;&#x3002;</p>
</P>

<h2 id="X-Window-System-Use-with-the-X-Window-System">X Window System&#x306E;&#x4F7F;&#x7528;&#x4F8B;(Use with the X Window System)</h2>

<p>X Window System&#x306F;6000&#x756A;&#x4EE5;&#x4E0A;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x4F7F;&#x3046;&#x3002;</p>
</P>

<p><b>xlocal</b> &#x3068;&#x3044;&#x3046;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x306E;&#x30DD;&#x30FC;&#x30C8;6000&#x3067;X &#x30B5;&#x30FC;&#x30D0;&#x304C;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x306F;&#x901A;&#x5E38;&#x3001;<b>xlocal:0</b> &#x3068;&#x3044;&#x3046;&#x30C7;&#x30A3;&#x30B9;&#x30D7;&#x30EC;&#x30A4;&#x3067;&#x4F7F;&#x308F;&#x308C;&#x3066;&#x3044;&#x308B;&#x30DD;&#x30FC;&#x30C8;&#x3067;&#x3042;&#x308B;&#x3002; &#x305D;&#x3057;&#x3066;&#x3001;<b>xremote</b>&#x3068;&#x3044;&#x3046;(&#x30EA;&#x30E2;&#x30FC;&#x30C8;)&#x30DE;&#x30B7;&#x30F3;&#x304B;&#x3089;&#x3001; &#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x306E;&#x30C7;&#x30A3;&#x30B9;&#x30D7;&#x30EC;&#x30A4;&#x306B;&#x5B89;&#x5168;&#x306A; <b>xterm</b> &#x306E;&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x9001;&#x308A;&#x8FD4;&#x3057;&#x305F;&#x3044;&#x3082;&#x306E;&#x3068;&#x3059;&#x308B;&#x3002; &#x3053;&#x308C;&#x3092;&#x884C;&#x306A;&#x3046;&#x306B;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092; <b>xlocal</b> &#x3067;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee -r 6000 -s</code></pre>

<p>&#x305D;&#x3057;&#x3066;&#x3001;<b>xremote</b> &#x3067;&#x306F;</p>
</P>

<pre><code> zebedee 6001:xlocal:6000</code></pre>

<p>&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x3053;&#x3068;&#x306F;&#x3001;<b>xremote</b>&#x4E0A;&#x3067;&#x3001;&#x74B0;&#x5883;&#x5909;&#x6570;&#x306E;<b>DISPLAY</b>&#x304C;<code>localhost:1</code>&#x306B;&#x8A2D;&#x5B9A;&#x3055;&#x308C;&#x3066;&#x3044;&#x308C;&#x3070;&#x3001; X&#x306E;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x306F;<b>xlocal</b>&#x306B;&#x5230;&#x7740;&#x3059;&#x308B;&#x3053;&#x3068;&#x3092;&#x610F;&#x5473;&#x3059;&#x308B;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x4F8B;&#x3048;&#x3070;<b>xterm</b>&#x3092;&#x5B89;&#x5168;&#x306B;<b>xremote</b>&#x304B;&#x3089;&#x9001;&#x308D;&#x3046;&#x3068;&#x3059;&#x308B;&#x306A;&#x3089;&#x3001; <b>xremote</b>&#x4E0A;&#x3067;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002;</p>
</P>

<pre><code> xterm -display localhost:1</code></pre>

<p>&#x3053;&#x308C;&#x304C;&#x6B63;&#x3057;&#x304F;&#x52D5;&#x4F5C;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F;&#x3001; <b>xremote</b>&#x306E;X&#x30B5;&#x30FC;&#x30D0;&#x306E;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30EA;&#x30B9;&#x30C8;&#x306B;<b>localhost</b>&#x306E;&#x30A8;&#x30F3;&#x30C8;&#x30EA;&#x30FC;&#x3092; &#x8FFD;&#x52A0;&#x3057;&#x306A;&#x304F;&#x3066;&#x306F;&#x306A;&#x3089;&#x306A;&#x3044;&#x3002; &#x3053;&#x308C;&#x3092;&#x884C;&#x3046;&#x306B;&#x306F;&#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x5B9F;&#x884C;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> xhost +localhost</code></pre>

<h2 id="HTTP-Securing-HTTP-traffic">HTTP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;(Securing HTTP traffic)</h2>

<p><b>Zebedee</b>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x3092;&quot;multi-use&quot;&#x30E2;&#x30FC;&#x30C9;&#x3067;&#x52D5;&#x4F5C;&#x3055;&#x305B;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x5168;&#x3066;&#x306E;Web&#x30B5;&#x30FC;&#x30D0;&#x3078;&#x306E;&#x901A;&#x4FE1;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;Web&#x30B5;&#x30FC;&#x30D0;&#x304C; <b>webhost</b> &#x306E;&#x30DD;&#x30FC;&#x30C8;80&#x3067;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x304A;&#x308A;&#x3001; &#x305D;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x30DE;&#x30B7;&#x30F3;&#x3067; <b>Zebedee</b> &#x30B5;&#x30FC;&#x30D0;&#x3082;&#x52D5;&#x4F5C;&#x3057;&#x3066;&#x3044;&#x308B;&#x3068;&#x3057;&#x305F;&#x3089;&#x3001; &#x6B21;&#x306E;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x304C;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DE;&#x30B7;&#x30F3;&#x306E;8000&#x756A;&#x30DD;&#x30FC;&#x30C8;&#x7D4C;&#x7531;&#x306E;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3092;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee 8000:webhost:80</code></pre>

<p>will set up a tunnel via port 8000 on the client host. Now any URLs that previously were addressed via <b>webhost</b>, for example:</p>
</P>

<pre><code> http://webhost/private/index.html</code></pre>

<p>&#x306F;&#x3001;&#x3053;&#x306E;&#x72B6;&#x614B;&#x3067;&#x306F;&#x6B21;&#x306E;URL&#x3067;&#x5B89;&#x5168;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<pre><code> http://localhost:8000/private/index.html</code></pre>

<p>&quot;<code>localhost:8000</code>&quot;&#x3092;&#x3042;&#x306A;&#x305F;&#x306E;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x30FC;&#x3068;&#x3057;&#x3066;&#x8A2D;&#x5B9A;&#x3059;&#x308B;&#x3053;&#x3068;&#x3067;&#x3001; &#x5168;&#x3066;&#x306E;HTTP&#x306E;&#x30C8;&#x30E9;&#x30D5;&#x30A3;&#x30C3;&#x30AF;&#x3092;&#x5B89;&#x5168;&#x306A;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x7D4C;&#x7531;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x3057;&#x304B;&#x3057;&#x3001;&#x6CE8;&#x610F;&#x3059;&#x3079;&#x304D;&#x3053;&#x3068;&#x306F;&#x3001;HTTP&#x306E;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x30FC;&#x8A2D;&#x5B9A;&#x4EE5;&#x5916;&#x306B;&#x3053;&#x306E;&#x8A2D;&#x5B9A;&#x3092;&#x3057;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002; Secure HTTP&#x3092;&#x542B;&#x3080;&#x4ED6;&#x306E;&#x30D7;&#x30ED;&#x30C8;&#x30B3;&#x30EB;&#x306F;&#x4ED6;&#x306E;&#x65B9;&#x6CD5;&#x3067;&#x30EA;&#x30C0;&#x30A4;&#x30EC;&#x30AF;&#x30C8;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; &#x307B;&#x3068;&#x3093;&#x3069;&#x306E;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306F;&#x9055;&#x3046;&#x30C9;&#x30E1;&#x30A4;&#x30F3;&#x306B;&#x9055;&#x3046;&#x30D7;&#x30ED;&#x30AD;&#x30B7;&#x30FC;&#x3092;&#x5272;&#x308A;&#x3042;&#x3066;&#x308B;&#x8A2D;&#x5B9A;&#x3082;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;&#x3002; &#x305D;&#x306E;&#x305F;&#x3081;&#x3001;&#x5FC5;&#x8981;&#x306A;&#x3082;&#x306E;&#x3060;&#x3051;&#x9078;&#x3093;&#x3067;&#x30AC;&#x30FC;&#x30C9;&#x3059;&#x308B;&#x3053;&#x3068;&#x3082;&#x3067;&#x304D;&#x308B;&#x3002; &#x3053;&#x308C;&#x3092;&#x884C;&#x306A;&#x3046;&#x65B9;&#x6CD5;&#x306B;&#x3064;&#x3044;&#x3066;&#x306F;&#x30D6;&#x30E9;&#x30A6;&#x30B6;&#x306E;&#x30DE;&#x30CB;&#x30E5;&#x30A2;&#x30EB;&#x3092;&#x53C2;&#x7167;&#x3055;&#x308C;&#x305F;&#x3057;&#x3002;</p>
</P>

<h2 id="FTP-Securing-FTP-traffic">FTP&#x306E;&#x901A;&#x4FE1;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;(Securing FTP traffic)</h2>

<p>&#x4EE5;&#x4E0B;&#x306E;&#x624B;&#x6BB5;&#x3067;&#x3001; <b>Zebedee</b>&#x3092;&#x4F7F;&#x3044;&#x591A;&#x304F;&#x306E;FTP&#x30B5;&#x30FC;&#x30D0;&#x3078;&#x306E;FTP&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3; (&#x30E6;&#x30FC;&#x30B6;&#x540D;&#x3068;&#x30D1;&#x30B9;&#x30EF;&#x30FC;&#x30C9;&#x304C;&#x9001;&#x3089;&#x308C;&#x308B;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;)&#x3092;&#x5B88;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3055;&#x3089;&#x306B;&#x3001;<b>Zebedee</b>&#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x542B;&#x307E;&#x308C;&#x308B; <b>ftpgw.tcl</b> &#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x306B;&#x3088;&#x3063;&#x3066;&#x3001; &#x30D1;&#x30C3;&#x30B7;&#x30D6;&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3055;&#x3048;&#x3082;&#x5B88;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<p>FTP&#x30B5;&#x30FC;&#x30D0;&#x3092;&#x6271;&#x3046;&#x6700;&#x3082;&#x5358;&#x7D14;&#x306A;&#x65B9;&#x6CD5;&#x306F;&#x3001;&#x4EE5;&#x4E0B;&#x306E;&#x3088;&#x3046;&#x306B; <b>Zebedee</b> &#x3092;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3053;&#x3068;&#x3060;&#x3002;</p>
</P>

<pre><code> zebedee -s -r ftp ftpserverhost</code></pre>

<p>FTP&#x30B5;&#x30FC;&#x30D0;&#x3068;&#x540C;&#x3058;&#x30DE;&#x30B7;&#x30F3;&#x3067; <b>Zebedee</b> &#x3092;&#x52D5;&#x4F5C;&#x3055;&#x305B;&#x3066;&#x3044;&#x3066;&#x3082;&#x3001;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067; &#x660E;&#x793A;&#x7684;&#x306B;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;(&#x307E;&#x305F;&#x306F; <b><a href="#item_redirecthost">redirecthost</a></b>&#x30AD;&#x30FC;&#x30EF;&#x30FC;&#x30C9;&#x3092;&#x4F7F;&#x7528;)&#x3002;&#x305D;&#x308C;&#x3092; <b>localhost</b>&#x3068;&#x3057;&#x3066;&#x53C2;&#x7167;&#x3057;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30B7;&#x30B9;&#x30C6;&#x30E0;&#x3067;&#x306F; <b>Zebedee</b>&#x3092;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3001;&#x30DD;&#x30FC;&#x30C8;10000&#x756A;&#x7D4C;&#x7531;&#x306E;&#x30DE;&#x30EB;&#x30C1;&#x30E6;&#x30FC;&#x30B9;&#x30C8;&#x30F3;&#x30CD;&#x30EB; &#x3092;&#x69CB;&#x7BC9;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee 10000:ftpserverhost:ftp</code></pre>

<p>FTP&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x63A5;&#x7D9A;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306A;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> ftp clienthost 10000</code></pre>

<p>&#x304F;&#x3069;&#x3044;&#x3088;&#x3046;&#x3060;&#x304C;&#x3001;<b>localhost</b> &#x3067;&#x306A;&#x304F;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x3002; &#x3082;&#x3057;&#x3001;windows&#x306E;&#x6A19;&#x6E96;FTP&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306E;&#x3088;&#x3046;&#x306B;&#x3001; &#x3042;&#x306A;&#x305F;&#x306E;FTP&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x30E9;&#x30A4;&#x30F3;&#x3067;&#x30DD;&#x30FC;&#x30C8;&#x3092;&#x6307;&#x5B9A;&#x3067;&#x304D;&#x306A;&#x3044;&#x6642;&#x306F;&#x3001; &#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306E;&#x4E2D;&#x3067;(FTP&#x30BB;&#x30C3;&#x30B7;&#x30E7;&#x30F3;&#x306E;&#x4E2D;&#x3067;) &quot;<code>open clienthost 10000</code>&quot; &#x3068;&#x3044;&#x3046;&#x30B3;&#x30DE;&#x30F3;&#x30C9;&#x3092;&#x4F7F;&#x3046;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; &#x3082;&#x3057;&#x3001;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30DE;&#x30B7;&#x30F3;&#x3067;FTP&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x7ACB;&#x3061;&#x4E0A;&#x304C;&#x3063;&#x3066;&#x3044;&#x306A;&#x3051;&#x308C;&#x3070;&#x3001; <b>Zebedee</b> &#x3092;&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x8D77;&#x52D5;&#x3057;&#x3066;&#x3082;&#x3088;&#x3044;&#x3002;</p>
</P>

<pre><code> zebedee ftp:ftpserverhost:ftp</code></pre>

<p>&#x3053;&#x308C;&#x3060;&#x3068;FTP&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x6B21;&#x306E;&#x3088;&#x3046;&#x306B;&#x8D77;&#x52D5;&#x3067;&#x304D;&#x308B;&#x3002;</p>
</P>

<pre><code> ftp clienthost</code></pre>

<p>FTP&#x306E;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x304C;&#x540C;&#x3058;&#x6240;&#x304B;&#x3089;&#x6765;&#x3066;&#x3044;&#x308B;&#x304B; &#x3069;&#x3046;&#x304B;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3059;&#x308B;FTP&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x3042;&#x308B;&#x304C;&#x3001;&#x305D;&#x3046;&#x3044;&#x3046;&#x30B5;&#x30FC;&#x30D0;&#x306B;&#x5BFE;&#x3057;&#x3066;&#x306F;&#x4E0A;&#x8A18;&#x306E;&#x624B;&#x6CD5;&#x306F; &#x3046;&#x307E;&#x304F;&#x3044;&#x304B;&#x306A;&#x3044;&#x3002;<b>wu-ftpd</b> &#x306E;&#x3088;&#x3046;&#x306A;&#x30E1;&#x30B8;&#x30E3;&#x30FC;&#x306A;FTP&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3053;&#x306E;&#x70B9;&#x306B; &#x3064;&#x3044;&#x3066;&#x53B3;&#x3057;&#x304F;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3092;&#x5165;&#x308C;&#x308B;(&#x30BB;&#x30AD;&#x30E5;&#x30EA;&#x30C6;&#x30A3;&#x9762;&#x304B;&#x3089;&#x306F;&#x671B;&#x307E;&#x3057;&#x3044;&#x3053;&#x3068;&#x3060;&#x304C;&hellip;)&#x3002; &#x3082;&#x3057;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x3078;&#x306E;&#x63A5;&#x7D9A;&#x306F;&#x660E;&#x3089;&#x304B;&#x306B;&#x3046;&#x307E;&#x304F;&#x3044;&#x304F;&#x306E;&#x306B;&#x3001; &#x30D5;&#x30A1;&#x30A4;&#x30EB;&#x306E;&#x30EA;&#x30B9;&#x30C8;&#x3084;&#x8AAD;&#x307F;&#x51FA;&#x3057;&#x3067;&#x5931;&#x6557;&#x3057;&#x305F;&#x308A;&#x30CF;&#x30F3;&#x30B0;&#x30A2;&#x30C3;&#x30D7;&#x3059;&#x308B;&#x306A;&#x3089;&#x3001; &#x305D;&#x306E;&#x30B5;&#x30FC;&#x30D0;&#x304C;&#x3053;&#x3053;&#x3092;&#x53B3;&#x3057;&#x304F;&#x30C1;&#x30A7;&#x30C3;&#x30AF;&#x3059;&#x308B;&#x30BF;&#x30A4;&#x30D7;&#x3060;&#x3063;&#x305F;&#x3001;&#x3068;&#x3044;&#x3046;&#x3053;&#x3068;&#x3060;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x554F;&#x984C;&#x3092;&#x514B;&#x670D;&#x3059;&#x308B;&#x306E;&#x3092;&#x52A9;&#x3051;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001;<b>ftpgw.tcl</b> &#x3068;&#x3044;&#x3046;FTP&#x30B2;&#x30FC;&#x30C8;&#x30A6;&#x30A7;&#x30A4;&#x306E; &#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C8;&#x304C; <b>Zebedee</b> &#x30D1;&#x30C3;&#x30B1;&#x30FC;&#x30B8;&#x306B;&#x306F;&#x542B;&#x307E;&#x308C;&#x3066;&#x3044;&#x308B;&#x3002; &#x3053;&#x306E;&#x30D7;&#x30ED;&#x30B0;&#x30E9;&#x30E0;&#x306F;&#x30D5;&#x30EA;&#x30FC;&#x306B;&#x5165;&#x624B;&#x53EF;&#x80FD;&#x3067;&#x3042;&#x308B;Tcl&#x30B9;&#x30AF;&#x30EA;&#x30D7;&#x30C6;&#x30A3;&#x30F3;&#x30B0;&#x8A00;&#x8A9E; (http://www.scriptics.com&#x53C2;&#x7167;)&#x3067;&#x66F8;&#x304B;&#x308C;&#x3066;&#x3044;&#x3066;&#x3001; FTP&#x306E;&#x30EA;&#x30AF;&#x30A8;&#x30B9;&#x30C8;&#x3092;&#x4E2D;&#x7D99;&#x3057;&#x3066;&#x518D;&#x9001;&#x4FE1;&#x3057;&#x3001;&#x30B5;&#x30FC;&#x30D0;&#x304B;&#x3089;<b>Zebedee</b> &#x306E;&#x5B58;&#x5728;&#x3092;&#x96A0;&#x3059;&#x3002; &#x3053;&#x308C;&#x306F; <b>Zebedee</b> &#x30B5;&#x30FC;&#x30D0;&#x3068;&#x540C;&#x3058;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x8D70;&#x3089;&#x305B;&#x308B;&#x5FC5;&#x8981;&#x304C;&#x3042;&#x308B;&#x3002; FTP&#x30B5;&#x30FC;&#x30D0;&#x3082;&#x540C;&#x3058;&#x30DE;&#x30B7;&#x30F3;&#x3067;&#x52D5;&#x3044;&#x3066;&#x3044;&#x308B;&#x306A;&#x3089;&#x3001;&#x5358;&#x306B;&#x3053;&#x3046;&#x8D77;&#x52D5;&#x3059;&#x308C;&#x3070;&#x3088;&#x3044;&#x3002;</p>
</P>

<pre><code> tclsh ftpgw.tcl</code></pre>

<p>&#x3053;&#x308C;&#x3067;&#x30B2;&#x30FC;&#x30C8;&#x30A6;&#x30A7;&#x30A4;&#x306F;&#x30DD;&#x30FC;&#x30C8;2121&#x3067;&#x5F85;&#x3061;&#x53D7;&#x3051;&#x308B;&#x3002;&#x660E;&#x3089;&#x304B;&#x306B;&#x3001;&#x5B9F;&#x969B;&#x306E;&#x4F7F;&#x7528;&#x3067;&#x306F;&#x3053;&#x308C; &#x3092;&#x30D0;&#x30C3;&#x30AF;&#x30B0;&#x30E9;&#x30A6;&#x30F3;&#x30C9;&#x3067;&#x8D77;&#x52D5;&#x3057;&#x305F;&#x3044;&#x3060;&#x308D;&#x3046;&#x3002;&#x305D;&#x308C;&#x304B;&#x3089;&#x3001;<b>Zebedee</b>&#x30B5;&#x30FC;&#x30D0;&#x3092;</p>
</P>

<pre><code> zebedee -s -r 2121</code></pre>

<p>&#x3068;&#x3057;&#x3066;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x30B1;&#x30FC;&#x30B9;&#x3067;&#x306F;&#x30ED;&#x30FC;&#x30AB;&#x30EB;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x5FC5;&#x8981;&#x306F;&#x306A;&#x3044; (&#x3057;&#x305F;&#x3051;&#x308C;&#x3070;&#x3057;&#x3066;&#x3082;&#x304B;&#x307E;&#x308F;&#x306A;&#x3044;&#x304C;)&#x3002; &#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x5074;&#x3067;&#x306F;&#x3053;&#x3046;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee 2121:ftpserverhost:2121</code></pre>

<p>&#x305D;&#x308C;&#x304B;&#x3089;&#x3053;&#x3046;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> ftp clienthost 2121</code></pre>

<p>&#x3053;&#x3061;&#x3089;&#x3067;&#x306F;&#x3001;&#x3053;&#x306E;&#x5834;&#x5408;&#x3067;&#x3082;&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x30DB;&#x30B9;&#x30C8;&#x540D;&#x3092;&#x4F7F;&#x3046;&#x3002;</p>
</P>

<p>&#x3053;&#x306E;&#x8A2D;&#x5B9A;&#x3067;&#x306F;&#x3001;FTP&#x306E;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306F;&#x30C8;&#x30F3;&#x30CD;&#x30EB;&#x3055;&#x308C;&#x308B;&#x304C;&#x3001; &#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x306F;&#x4E00;&#x5207;&#x5F71;&#x97FF;&#x3092;&#x4E0E;&#x3048;&#x306A;&#x3044;&#x3002; &#x3082;&#x3057;&#x3001;&#x3042;&#x306A;&#x305F;&#x306E;FTP&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x304C;&#x30D1;&#x30C3;&#x30B7;&#x30D6;&#x30E2;&#x30FC;&#x30C9;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x308C;&#x3070;&#x3001; <b>ftpgw.tcl</b> &#x3067;&#x30C7;&#x30FC;&#x30BF;&#x30C1;&#x30E3;&#x30F3;&#x30CD;&#x30EB;&#x3082;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;&#x3053;&#x3068;&#x304C;&#x3067;&#x304D;&#x308B;&#x3002; Netscape Navigator &#x3084; Windows&#x7528;&#x306E;WS_FTP&#x306A;&#x3069;&#x306F;&#x305D;&#x308C;&#x3092;&#x30B5;&#x30DD;&#x30FC;&#x30C8;&#x3057;&#x3066;&#x3044;&#x308B;&#x3002;</p>
</P>

<p>&#x30D1;&#x30C3;&#x30B7;&#x30D6;&#x30E2;&#x30FC;&#x30C9;&#x306E;&#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x5B89;&#x5168;&#x306B;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x306F;&#x3001; &#x307E;&#x305A;&#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x306B;&#x4F7F;&#x3046;&#x30DD;&#x30FC;&#x30C8;&#x756A;&#x53F7;&#x306E;&#x7BC4;&#x56F2;&#x3092;&#x9078;&#x3070;&#x306A;&#x304F;&#x3066;&#x306F;&#x3044;&#x3051;&#x306A;&#x3044;&#x3002; &#x3053;&#x306E;&#x4F8B;&#x3067;&#x306F;&#x3002;30000&#x304B;&#x3089;30100&#x756A;&#x3092;&#x4F7F;&#x3046;&#x3082;&#x306E;&#x3068;&#x3059;&#x308B;&#x3002; &#x307E;&#x305A;&#x3001;<b>ftpgw.tcl</b> &#x3092; &#x8D77;&#x52D5;&#x3059;&#x308B;&#x6642;&#x306B;&#x3001;&#x3053;&#x306E;&#x30DD;&#x30FC;&#x30C8;&#x7BC4;&#x56F2;&#x3092;&#x6307;&#x5B9A;&#x3059;&#x308B;&#x305F;&#x3081;&#x306B;&#x3001; <b>-p</b>&#x30AA;&#x30D7;&#x30B7;&#x30E7;&#x30F3;&#x3092;&#x4F7F;&#x7528;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> tclsh ftpgw.tcl -p 30000-30100</code></pre>

<p><b>Zebedee</b>&#x30B5;&#x30FC;&#x30D0;&#x306F;&#x3053;&#x306E;&#x3088;&#x3046;&#x306B;&#x8D77;&#x52D5;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> zebedee -s -r 2121,30000-30100</code></pre>

<p>&#x30AF;&#x30E9;&#x30A4;&#x30A2;&#x30F3;&#x30C8;&#x306F;&#x3053;&#x3046;&#x3060;&#x3002;</p>
</P>

<pre><code> zebedee 2121,30000-30100:ftpserverhost:2121,30000-30100</code></pre>

<p>Netscape&#x3092;&#x4F7F;&#x3063;&#x3066;&#x30B3;&#x30F3;&#x30C8;&#x30ED;&#x30FC;&#x30EB;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3068;&#x30C7;&#x30FC;&#x30BF;&#x30B3;&#x30CD;&#x30AF;&#x30B7;&#x30E7;&#x30F3;&#x3092; &#x4E21;&#x65B9;&#x5B89;&#x5168;&#x306B;&#x30A2;&#x30AF;&#x30BB;&#x30B9;&#x3059;&#x308B;&#x306B;&#x306F;&#x3001;&#x3053;&#x306E;&#x3088;&#x3046;&#x306A;URL&#x3092;&#x5165;&#x529B;&#x3059;&#x308B;&#x3002;</p>
</P>

<pre><code> ftp://username@clienthost:2121/</code></pre>

<p>&#x3053;&#x3053;&#x3067;<i>username</i>&#x306F;FTP&#x30B5;&#x30FC;&#x30D0;&#x3067;&#x306E;&#x30E6;&#x30FC;&#x30B6;&#x540D;&#x3067;&#x3042;&#x308B;&#x3002;</p>
</P>

<h1 id="CREDITS-AND-LEGALITIES">CREDITS AND LEGALITIES</h1>

<p>The following information can also be found in the file <i>LICENCE.txt</i> in the <b>Zebedee</b> distribution.</p>
</P>

<pre><code> Copyright (c) 1999, 2000 by Neil Winton. All Rights Reserved.

 This program is free software; you can redistribute it and/or modify
 it under the terms of the GNU General Public License as published by
 the Free Software Foundation; either version 2 of the License, or
 (at your option) any later version.

 This program is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 GNU General Public License for more details.

 You should have received a copy of the GNU General Public License
 along with this program; if not, write to the Free Software
 Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307,
 USA.</code></pre>

<p>A copy of the GNU General Public License can be found in the file <i>GPL2.txt</i>.</p>
</P>

<p>You may obtain the latest copy of <b>Zebedee</b>, including full source code from http://www.winton.org.uk/zebedee/ and other enquiries about <b>Zebedee</b> can be e-mailed to the author at zebedee@winton.org.uk</p>
</P>

<p><b>Zebedee</b> would not have been possible without the use of a large amount of freely-available software to do all the really hard stuff. I gratefully acknowledge the contributions made by the authors of the following software packages.</p>
</P>

<p><b>Zebedee</b> uses the &quot;Blowfish&quot; encryption algorithm devised by Bruce Schneier. For more information on Blowfish see http://www.counterpane.com/blowfish.html . The implementation used is by Eric Young and is covered by the following copyright:</p>
</P>

<pre><code> Copyright (C) 1995-1997 Eric Young (eay@mincom.oz.au)
 All rights reserved.
 
 This package is an Blowfish implementation written
 by Eric Young (eay@mincom.oz.au).
 
 This library is free for commercial and non-commercial use as long as
 the following conditions are aheared to.  The following conditions
 apply to all code found in this distribution.
 
 Copyright remains Eric Young&#39;s, and as such any Copyright notices in
 the code are not to be removed.
 
 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:
 1. Redistributions of source code must retain the copyright
 notice, this list of conditions and the following disclaimer.
 2. Redistributions in binary form must reproduce the above copyright
 notice, this list of conditions and the following disclaimer in the
 documentation and/or other materials provided with the distribution.
 3. All advertising materials mentioning features or use of this software
 must display the following acknowledgement:
 This product includes software developed by Eric Young (eay@mincom.oz.au)
 
 THIS SOFTWARE IS PROVIDED BY ERIC YOUNG &#147;AS IS&#39;&#39; AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 SUCH DAMAGE.
 
 The license and distribution terms for any publically available version or
 derivative of this code cannot be changed.  i.e. this code cannot simply be
 copied and put under another distrubution license
 [including the GNU Public License.]
 
 The reason behind this being stated in this direct manner is past
 experience in code simply being copied and the attribution removed
 from it and then being distributed as part of other packages. This
 implementation was a non-trivial and unpaid effort.</code></pre>

<p><b>Zebedee</b> uses the <b>zlib</b> compression library by Jean-loup Gailly and Mark Adler. It is covered by the following copyright notice:</p>
</P>

<pre><code> (C) 1995-1998 Jean-loup Gailly and Mark Adler

 This software is provided &#39;as-is&#39;, without any express or implied
 warranty.  In no event will the authors be held liable for any damages
 arising from the use of this software.

 Permission is granted to anyone to use this software for any purpose,
 including commercial applications, and to alter it and redistribute it
 freely, subject to the following restrictions:

 1. The origin of this software must not be misrepresented; you must not
 claim that you wrote the original software. If you use this software
 in a product, an acknowledgment in the product documentation would be
 appreciated but is not required.
 2. Altered source versions must be plainly marked as such, and must not be
 misrepresented as being the original software.
 3. This notice may not be removed or altered from any source distribution.

 Jean-loup Gailly        Mark Adler
 jloup@gzip.org          madler@alumni.caltech.edu</code></pre>

<p><b>Zebedee</b> may use the <b>bzip2</b> compression library by Julian Seward which is covered by the following licence:</p>
</P>

<pre><code> This program, &quot;bzip2&quot; and associated library &quot;libbzip2&quot;, are
 copyright (C) 1996-1999 Julian R Seward.  All rights reserved.
 
 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:
 
 1. Redistributions of source code must retain the above copyright
    notice, this list of conditions and the following disclaimer.
 
 2. The origin of this software must not be misrepresented; you must 
    not claim that you wrote the original software.  If you use this 
    software in a product, an acknowledgment in the product 
    documentation would be appreciated but is not required.
 
 3. Altered source versions must be plainly marked as such, and must
    not be misrepresented as being the original software.
 
 4. The name of the author may not be used to endorse or promote 
    products derived from this software without specific prior written 
    permission.
 
 THIS SOFTWARE IS PROVIDED BY THE AUTHOR &#147;AS IS&#39;&#39; AND ANY EXPRESS
 OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED.  IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR ANY
 DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 
 Julian Seward, Cambridge, UK.
 jseward@acm.org
 bzip2/libbzip2 version 0.9.5 of 24 May 1999</code></pre>

<p>By default <b>Zebedee</b> is built using an aribtrary precision integer arithmetic library derived from the sources to <code>mirrordir-0.10.49</code> which in turn derived this from the <b>Python</b> sources. The copyright is as follows:</p>
</P>

<pre><code> huge-number.c: arbitrary precision integer library from Python sources
 This has nothing to do with cryptography.
 Copyright (C) 1998 Paul Sheer
 
 This program is free software; you can redistribute it and/or modify
 it under the terms of the GNU General Public License as published by
 the Free Software Foundation; either version 2 of the License, or
 (at your option) any later version.
 
 This program is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 GNU General Public License for more details.
 
 You should have received a copy of the GNU General Public License
 along with this program; if not, write to the Free Software
 Foundation, Inc., 675 Mass Ave, Cambridge, MA 02139, USA.
 
 This file was taken from the Python source for `long&#39; type
 integers. I have changed it to compile independently of the
 Python source, and added the optimisation that GNU C can
 use 31 bit digits instead of Python&#39;s 15 bit. You can download
 the original from www.python.org. This file bears little
 resemblance to the original though - paul
 
 Copyright 1991-1995 by Stichting Mathematisch Centrum, Amsterdam,
 The Netherlands.
 
                         All Rights Reserved
 
 Permission to use, copy, modify, and distribute this software and its
 documentation for any purpose and without fee is hereby granted,
 provided that the above copyright notice appear in all copies and that
 both that copyright notice and this permission notice appear in
 supporting documentation, and that the names of Stichting Mathematisch
 Centrum or CWI or Corporation for National Research Initiatives or
 CNRI not be used in advertising or publicity pertaining to
 distribution of the software without specific, written prior
 permission.
 
 While CWI is the initial source for this software, a modified version
 is made available by the Corporation for National Research Initiatives
 (CNRI) at the Internet address ftp://ftp.python.org.
 
 STICHTING MATHEMATISCH CENTRUM AND CNRI DISCLAIM ALL WARRANTIES WITH
 REGARD TO THIS SOFTWARE, INCLUDING ALL IMPLIED WARRANTIES OF
 MERCHANTABILITY AND FITNESS, IN NO EVENT SHALL STICHTING MATHEMATISCH
 CENTRUM OR CNRI BE LIABLE FOR ANY SPECIAL, INDIRECT OR CONSEQUENTIAL
 DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR
 PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER
 TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR
 PERFORMANCE OF THIS SOFTWARE.</code></pre>

<p><b>Zebedee</b> uses the Secure Hash Algorith (SHA) the code for which was derived from Uwe Hollerbach&#39;s SHA module for <b>perl</b>. The code contains the following statement:</p>
</P>

<pre><code> NIST Secure Hash Algorithm
 heavily modified by Uwe Hollerbach &lt;uh@alumni.caltech edu&gt;
 from Peter C. Gutmann&#39;s implementation as found in
 Applied Cryptography by Bruce Schneier

 This code is in the public domain</code></pre>

<p>Under Windows, <b>Zebedee</b> uses an implementation of the <i>getopt</i> function covered by the following copyright:</p>
</P>

<pre><code> Copyright (c) 1987, 1993, 1994
        The Regents of the University of California.  All rights reserved.
 
 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions
 are met:
 1. Redistributions of source code must retain the above copyright
 notice, this list of conditions and the following disclaimer.
 2. Redistributions in binary form must reproduce the above copyright
 notice, this list of conditions and the following disclaimer in the
 documentation and/or other materials provided with the distribution.
 3. All advertising materials mentioning features or use of this software
 must display the following acknowledgement:
        This product includes software developed by the University of
        California, Berkeley and its contributors.
 4. Neither the name of the University nor the names of its contributors
 may be used to endorse or promote products derived from this software
 without specific prior written permission.
 
 THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS &#147;AS IS&#39;&#39; AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
 OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
 SUCH DAMAGE.</code></pre>

<h2 id="Thanks">Thanks</h2>

<p>Special thanks go to those people who have taken the trouble to give me feedback and suggestions for improvement!</p>
</P>

<pre><code> $Id: zebedee.pod,v 1.1 2000/07/18 02:05:04 tnaka Exp $</code></pre>


</body>

</html>


